[Killed] BlockStatement
src/determinant.js:2:33
 class Determinant {
-  subMatrix = (matrix, i, j) => {
-    let matrixSize = matrix[0].length;
-    if (matrixSize === 1) {
-      return matrix[0][0];
-    }
-    let subMatrix = [];
-    for (let x = 0; x < matrixSize; x++) {
-      if (x === i) {
-        continue;
-      }
-      subMatrix.push([]);
-      for (let y = 0; y < matrixSize; y++) {
-        if (y === j) {
-          continue;
-        }
-        subMatrix[subMatrix.length - 1].push(matrix[x][y]);
-      }
-    }
-    return subMatrix;
-  };
+  subMatrix = (matrix, i, j) => {};
 
   isMatrixSquare = (matrix) => {
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected undefined to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ConditionalExpression
src/determinant.js:4:9
 class Determinant {
   subMatrix = (matrix, i, j) => {
     let matrixSize = matrix[0].length;
-    if (matrixSize === 1) {
+    if (true) {
       return matrix[0][0];
     }
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected 1 to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] EqualityOperator
src/determinant.js:4:9
 class Determinant {
   subMatrix = (matrix, i, j) => {
     let matrixSize = matrix[0].length;
-    if (matrixSize === 1) {
+    if (matrixSize !== 1) {
       return matrix[0][0];
     }
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected 1 to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ArrayDeclaration
src/determinant.js:7:21
     if (matrixSize === 1) {
       return matrix[0][0];
     }
-    let subMatrix = [];
+    let subMatrix = ["Stryker was here"];
     for (let x = 0; x < matrixSize; x++) {
       if (x === i) {
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [ 'Stryker was here', [ 4, 6 ], …(1) ] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ConditionalExpression
src/determinant.js:8:21
       return matrix[0][0];
     }
     let subMatrix = [];
-    for (let x = 0; x < matrixSize; x++) {
+    for (let x = 0; false; x++) {
       if (x === i) {
         continue;
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] EqualityOperator
src/determinant.js:8:21
       return matrix[0][0];
     }
     let subMatrix = [];
-    for (let x = 0; x < matrixSize; x++) {
+    for (let x = 0; x >= matrixSize; x++) {
       if (x === i) {
         continue;
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ConditionalExpression
src/determinant.js:9:11
     }
     let subMatrix = [];
     for (let x = 0; x < matrixSize; x++) {
-      if (x === i) {
+      if (true) {
         continue;
       }
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] BlockStatement
src/determinant.js:9:20
     }
     let subMatrix = [];
     for (let x = 0; x < matrixSize; x++) {
-      if (x === i) {
-        continue;
-      }
+      if (x === i) {}
       subMatrix.push([]);
       for (let y = 0; y < matrixSize; y++) {
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [ [ 1, 3 ], [ 4, 6 ], [ 7, 9 ] ] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ArrayDeclaration
src/determinant.js:12:22
       if (x === i) {
         continue;
       }
-      subMatrix.push([]);
+      subMatrix.push(["Stryker was here"]);
       for (let y = 0; y < matrixSize; y++) {
         if (y === j) {
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [ [ 'Stryker was here', 4, 6 ], …(1) ] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] BlockStatement
src/determinant.js:13:44
         continue;
       }
       subMatrix.push([]);
-      for (let y = 0; y < matrixSize; y++) {
-        if (y === j) {
-          continue;
-        }
-        subMatrix[subMatrix.length - 1].push(matrix[x][y]);
-      }
+      for (let y = 0; y < matrixSize; y++) {}
     }
     return subMatrix;
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [ [], [] ] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ConditionalExpression
src/determinant.js:13:23
         continue;
       }
       subMatrix.push([]);
-      for (let y = 0; y < matrixSize; y++) {
+      for (let y = 0; false; y++) {
         if (y === j) {
           continue;
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [ [], [] ] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ConditionalExpression
src/determinant.js:14:13
       }
       subMatrix.push([]);
       for (let y = 0; y < matrixSize; y++) {
-        if (y === j) {
+        if (true) {
           continue;
         }
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [ [], [] ] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ConditionalExpression
src/determinant.js:14:13
       }
       subMatrix.push([]);
       for (let y = 0; y < matrixSize; y++) {
-        if (y === j) {
+        if (false) {
           continue;
         }
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: expected [ [ 4, 5, 6 ], [ 7, 8, 9 ] ] to deeply equal [ [ 4, 6 ], [ 7, 9 ] ]

[Killed] ArithmeticOperator
src/determinant.js:17:19
         if (y === j) {
           continue;
         }
-        subMatrix[subMatrix.length - 1].push(matrix[x][y]);
+        subMatrix[subMatrix.length + 1].push(matrix[x][y]);
       }
     }
killedBy: Determinant subMatrix should return the correct submatrix
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/determinant.js:23:32
     return subMatrix;
   };
 
-  isMatrixSquare = (matrix) => {
-    let numRows = matrix.length;
-    for (let i = 0; i < numRows; i++) {
-      if (numRows !== matrix[i].length) {
-        return false;
-      }
-    }
-    return true;
-  };
+  isMatrixSquare = (matrix) => {};
 
   determinant = (matrix) => {
killedBy: Determinant isMatrixSquare should return true for a square matrix
statusReason: expected undefined to be true

[Killed] EqualityOperator
src/determinant.js:25:21
 
   isMatrixSquare = (matrix) => {
     let numRows = matrix.length;
-    for (let i = 0; i < numRows; i++) {
+    for (let i = 0; i >= numRows; i++) {
       if (numRows !== matrix[i].length) {
         return false;
killedBy: Determinant isMatrixSquare should return false for a non-square matrix
statusReason: expected true to be false

[Killed] ConditionalExpression
src/determinant.js:25:21
 
   isMatrixSquare = (matrix) => {
     let numRows = matrix.length;
-    for (let i = 0; i < numRows; i++) {
+    for (let i = 0; false; i++) {
       if (numRows !== matrix[i].length) {
         return false;
killedBy: Determinant isMatrixSquare should return false for a non-square matrix
statusReason: expected true to be false

[Killed] ConditionalExpression
src/determinant.js:26:11
   isMatrixSquare = (matrix) => {
     let numRows = matrix.length;
     for (let i = 0; i < numRows; i++) {
-      if (numRows !== matrix[i].length) {
+      if (true) {
         return false;
       }
killedBy: Determinant isMatrixSquare should return true for a square matrix
statusReason: expected false to be true

[Killed] ConditionalExpression
src/determinant.js:26:11
   isMatrixSquare = (matrix) => {
     let numRows = matrix.length;
     for (let i = 0; i < numRows; i++) {
-      if (numRows !== matrix[i].length) {
+      if (false) {
         return false;
       }
killedBy: Determinant isMatrixSquare should return false for a non-square matrix
statusReason: expected true to be false

[Killed] BooleanLiteral
src/determinant.js:27:16
     let numRows = matrix.length;
     for (let i = 0; i < numRows; i++) {
       if (numRows !== matrix[i].length) {
-        return false;
+        return true;
       }
     }
killedBy: Determinant isMatrixSquare should return false for a non-square matrix
statusReason: expected true to be false

[Killed] BlockStatement
src/determinant.js:33:29
     return true;
   };
 
-  determinant = (matrix) => {
-    if (
-      !Array.isArray(matrix) ||
-      matrix.length === 0 ||
-      !Array.isArray(matrix[0])
-    ) {
-      throw new Error("Input is not a valid 2D matrix.");
-    }
-    if (!(this.isMatrixSquare(matrix))) {
-      throw new Error("Square matrix is required.");
-    }
-    let numCols = matrix[0].length;
-    if (numCols === 1) {
-      return matrix[0][0];
-    }
-    let result = 0;
-    let setIndex = 0;
-    for (let i = 0; i < numCols; i++) {
-      result +=
-        Math.pow(-1, i) *
-        matrix[setIndex][i] *
-        this.determinant(this.subMatrix(matrix, setIndex, i));
-    }
-    return result;
-  };
+  determinant = (matrix) => {};
 }
 
killedBy: Determinant determinant should throw an error for an invalid matrix
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/determinant.js:35:7
 
   determinant = (matrix) => {
     if (
-      !Array.isArray(matrix) ||
-      matrix.length === 0 ||
-      !Array.isArray(matrix[0])
+      false
     ) {
       throw new Error("Input is not a valid 2D matrix.");
killedBy: Determinant determinant should throw an error for an invalid matrix
statusReason: expected [Function] to throw error including 'Input is not a valid 2D matrix.' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/determinant.js:35:7
 
   determinant = (matrix) => {
     if (
-      !Array.isArray(matrix) ||
-      matrix.length === 0 ||
-      !Array.isArray(matrix[0])
+      (!Array.isArray(matrix) || matrix.length === 0) && !Array.isArray(matrix[0])
     ) {
       throw new Error("Input is not a valid 2D matrix.");
killedBy: Determinant determinant should throw an error for an invalid matrix
statusReason: expected [Function] to throw error including 'Input is not a valid 2D matrix.' but got 'Square matrix is required.'

[Killed] EqualityOperator
src/determinant.js:36:7
   determinant = (matrix) => {
     if (
       !Array.isArray(matrix) ||
-      matrix.length === 0 ||
+      matrix.length !== 0 ||
       !Array.isArray(matrix[0])
     ) {
killedBy: Determinant determinant should throw an error for a non-square matrix
statusReason: expected [Function] to throw error including 'Square matrix is required.' but got 'Input is not a valid 2D matrix.'

[Survived] ConditionalExpression
src/determinant.js:36:7
   determinant = (matrix) => {
     if (
       !Array.isArray(matrix) ||
-      matrix.length === 0 ||
+      false ||
       !Array.isArray(matrix[0])
     ) {

[Killed] BooleanLiteral
src/determinant.js:37:7
     if (
       !Array.isArray(matrix) ||
       matrix.length === 0 ||
-      !Array.isArray(matrix[0])
+      Array.isArray(matrix[0])
     ) {
       throw new Error("Input is not a valid 2D matrix.");
killedBy: Determinant determinant should throw an error for an invalid matrix
statusReason: expected [Function] to throw error including 'Input is not a valid 2D matrix.' but got 'Square matrix is required.'

[Killed] BlockStatement
src/determinant.js:38:7
       !Array.isArray(matrix) ||
       matrix.length === 0 ||
       !Array.isArray(matrix[0])
-    ) {
-      throw new Error("Input is not a valid 2D matrix.");
-    }
+    ) {}
     if (!(this.isMatrixSquare(matrix))) {
       throw new Error("Square matrix is required.");
killedBy: Determinant determinant should throw an error for an invalid matrix
statusReason: expected [Function] to throw error including 'Input is not a valid 2D matrix.' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/determinant.js:41:9
     ) {
       throw new Error("Input is not a valid 2D matrix.");
     }
-    if (!(this.isMatrixSquare(matrix))) {
+    if (true) {
       throw new Error("Square matrix is required.");
     }
killedBy: Determinant determinant should return the correct determinant for a 1x1 matrix
statusReason: Square matrix is required.

[Killed] BooleanLiteral
src/determinant.js:41:9
     ) {
       throw new Error("Input is not a valid 2D matrix.");
     }
-    if (!(this.isMatrixSquare(matrix))) {
+    if (this.isMatrixSquare(matrix)) {
       throw new Error("Square matrix is required.");
     }
killedBy: Determinant determinant should throw an error for a non-square matrix
statusReason: expected [Function] to throw error including 'Square matrix is required.' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/determinant.js:45:24
       throw new Error("Square matrix is required.");
     }
     let numCols = matrix[0].length;
-    if (numCols === 1) {
-      return matrix[0][0];
-    }
+    if (numCols === 1) {}
     let result = 0;
     let setIndex = 0;
killedBy: Determinant determinant should return the correct determinant for a 1x1 matrix
statusReason: Input is not a valid 2D matrix.

[Killed] ConditionalExpression
src/determinant.js:45:9
       throw new Error("Square matrix is required.");
     }
     let numCols = matrix[0].length;
-    if (numCols === 1) {
+    if (true) {
       return matrix[0][0];
     }
killedBy: Determinant determinant should return the correct determinant for a 2x2 matrix
statusReason: expected 1 to equal -2

[Killed] EqualityOperator
src/determinant.js:50:21
     }
     let result = 0;
     let setIndex = 0;
-    for (let i = 0; i < numCols; i++) {
+    for (let i = 0; i >= numCols; i++) {
       result +=
         Math.pow(-1, i) *
killedBy: Determinant determinant should return the correct determinant for a 2x2 matrix
statusReason: expected +0 to equal -2

[Killed] UpdateOperator
src/determinant.js:50:34
     }
     let result = 0;
     let setIndex = 0;
-    for (let i = 0; i < numCols; i++) {
+    for (let i = 0; i < numCols; i--) {
       result +=
         Math.pow(-1, i) *
killedBy: Determinant determinant should return the correct determinant for a 2x2 matrix
statusReason: Square matrix is required.

[Killed] AssignmentOperator
src/determinant.js:51:7
     let result = 0;
     let setIndex = 0;
     for (let i = 0; i < numCols; i++) {
-      result +=
-        Math.pow(-1, i) *
-        matrix[setIndex][i] *
-        this.determinant(this.subMatrix(matrix, setIndex, i));
+      result -= Math.pow(-1, i) * matrix[setIndex][i] * this.determinant(this.subMatrix(matrix, setIndex, i));
     }
     return result;
killedBy: Determinant determinant should return the correct determinant for a 2x2 matrix
statusReason: expected 2 to equal -2

[Killed] ArithmeticOperator
src/determinant.js:52:9
     let setIndex = 0;
     for (let i = 0; i < numCols; i++) {
       result +=
-        Math.pow(-1, i) *
-        matrix[setIndex][i] *
-        this.determinant(this.subMatrix(matrix, setIndex, i));
+        Math.pow(-1, i) * matrix[setIndex][i] / this.determinant(this.subMatrix(matrix, setIndex, i));
     }
     return result;
killedBy: Determinant determinant should return the correct determinant for a 2x2 matrix
statusReason: expected -0.41666666666666663 to equal -2

[Killed] ArithmeticOperator
src/determinant.js:52:9
     let setIndex = 0;
     for (let i = 0; i < numCols; i++) {
       result +=
-        Math.pow(-1, i) *
-        matrix[setIndex][i] *
+        Math.pow(-1, i) / matrix[setIndex][i] *
         this.determinant(this.subMatrix(matrix, setIndex, i));
     }
killedBy: Determinant determinant should return the correct determinant for a 2x2 matrix
statusReason: expected 2.5 to equal -2
