[Survived] BlockStatement
src/find-month-calendar.js:2:19
 class Month {
-    constructor() {
-        this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
-        this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
-        this.epoch = { month: 1, year: 1900 }
-        this.monthDays = [31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
-        this.monthDaysLeap = [31, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
-    }
+    constructor() {}
     
     isLeapYear = (year) => {

[Survived] StringLiteral
src/find-month-calendar.js:3:27
 class Month {
     constructor() {
-        this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
+        this.Days = ['M', "", 'W', 'Th', 'F', 'S', 'Su']
         this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
         this.epoch = { month: 1, year: 1900 }

[Survived] ArrayDeclaration
src/find-month-calendar.js:3:21
 class Month {
     constructor() {
-        this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
+        this.Days = []
         this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
         this.epoch = { month: 1, year: 1900 }

[Survived] StringLiteral
src/find-month-calendar.js:4:55
 class Month {
     constructor() {
         this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
-        this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
+        this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', ""]
         this.epoch = { month: 1, year: 1900 }
         this.monthDays = [31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

[Survived] StringLiteral
src/find-month-calendar.js:4:39
 class Month {
     constructor() {
         this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
-        this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
+        this.BDays = ['M', 'Su', 'S', "", 'Th', 'W', 'T']
         this.epoch = { month: 1, year: 1900 }
         this.monthDays = [31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

[Killed] BlockStatement
src/find-month-calendar.js:10:28
         this.monthDaysLeap = [31, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
     }
     
-    isLeapYear = (year) => {
-        return year % 400 === 0 || (year % 100 !== 0 && year % 4 === 0)
-    }
+    isLeapYear = (year) => {}
 
     printCal(days, startDay, output = (value) => console.log(value)) {
killedBy: Month Calendar Tests should identify leap years correctly
statusReason: expected undefined to be false

[Killed] LogicalOperator
src/find-month-calendar.js:11:37
     }
     
     isLeapYear = (year) => {
-        return year % 400 === 0 || (year % 100 !== 0 && year % 4 === 0)
+        return year % 400 === 0 || (year % 100 !== 0 || year % 4 === 0)
     }
 
killedBy: Month Calendar Tests should identify leap years correctly
statusReason: expected true to be false

[Killed] ArithmeticOperator
src/find-month-calendar.js:11:16
     }
     
     isLeapYear = (year) => {
-        return year % 400 === 0 || (year % 100 !== 0 && year % 4 === 0)
+        return year * 400 === 0 || (year % 100 !== 0 && year % 4 === 0)
     }
 
killedBy: Month Calendar Tests should identify leap years correctly
statusReason: expected false to be true

[NoCoverage] ArrowFunction
src/find-month-calendar.js:14:39
         return year % 400 === 0 || (year % 100 !== 0 && year % 4 === 0)
     }
 
-    printCal(days, startDay, output = (value) => console.log(value)) {
+    printCal(days, startDay, output = () => undefined) {
         output('M   T   W   Th  F   S   Su')
         const dates = []

[NoCoverage] BlockStatement
src/find-month-calendar.js:14:70
         return year % 400 === 0 || (year % 100 !== 0 && year % 4 === 0)
     }
 
-    printCal(days, startDay, output = (value) => console.log(value)) {
-        output('M   T   W   Th  F   S   Su')
-        const dates = []
-        let i
-        for (i = 1; i <= days; i++) {
-            dates.push(i)
-        }
-        for (i = 0; i < this.Days.indexOf(startDay); i++) {
-            dates.unshift(' ')
-        }
-        while (true) {
-            let row = ''
-            for (i = 0; i < 7 && dates.length !== 0; i++) {
-                row += dates.shift()
-                while (row.length % 4 !== 0) {
-                    row += ' '
-                }
-            }
-            output(row)
-            if (dates.length === 0) break
-        }
-    }
+    printCal(days, startDay, output = (value) => console.log(value)) {}
 
     parseDate(date) {

[NoCoverage] UpdateOperator
src/find-month-calendar.js:18:32
         output('M   T   W   Th  F   S   Su')
         const dates = []
         let i
-        for (i = 1; i <= days; i++) {
+        for (i = 1; i <= days; i--) {
             dates.push(i)
         }

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:18:21
         output('M   T   W   Th  F   S   Su')
         const dates = []
         let i
-        for (i = 1; i <= days; i++) {
+        for (i = 1; false; i++) {
             dates.push(i)
         }

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:21:21
         for (i = 1; i <= days; i++) {
             dates.push(i)
         }
-        for (i = 0; i < this.Days.indexOf(startDay); i++) {
+        for (i = 0; false; i++) {
             dates.unshift(' ')
         }

[NoCoverage] EqualityOperator
src/find-month-calendar.js:21:21
         for (i = 1; i <= days; i++) {
             dates.push(i)
         }
-        for (i = 0; i < this.Days.indexOf(startDay); i++) {
+        for (i = 0; i >= this.Days.indexOf(startDay); i++) {
             dates.unshift(' ')
         }

[NoCoverage] StringLiteral
src/find-month-calendar.js:22:27
             dates.push(i)
         }
         for (i = 0; i < this.Days.indexOf(startDay); i++) {
-            dates.unshift(' ')
+            dates.unshift("")
         }
         while (true) {

[NoCoverage] BooleanLiteral
src/find-month-calendar.js:24:16
         for (i = 0; i < this.Days.indexOf(startDay); i++) {
             dates.unshift(' ')
         }
-        while (true) {
+        while (false) {
             let row = ''
             for (i = 0; i < 7 && dates.length !== 0; i++) {

[NoCoverage] EqualityOperator
src/find-month-calendar.js:26:25
         }
         while (true) {
             let row = ''
-            for (i = 0; i < 7 && dates.length !== 0; i++) {
+            for (i = 0; i <= 7 && dates.length !== 0; i++) {
                 row += dates.shift()
                 while (row.length % 4 !== 0) {

[NoCoverage] LogicalOperator
src/find-month-calendar.js:26:25
         }
         while (true) {
             let row = ''
-            for (i = 0; i < 7 && dates.length !== 0; i++) {
+            for (i = 0; i < 7 || dates.length !== 0; i++) {
                 row += dates.shift()
                 while (row.length % 4 !== 0) {

[NoCoverage] AssignmentOperator
src/find-month-calendar.js:27:17
         while (true) {
             let row = ''
             for (i = 0; i < 7 && dates.length !== 0; i++) {
-                row += dates.shift()
+                row -= dates.shift()
                 while (row.length % 4 !== 0) {
                     row += ' '

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:28:24
             let row = ''
             for (i = 0; i < 7 && dates.length !== 0; i++) {
                 row += dates.shift()
-                while (row.length % 4 !== 0) {
+                while (false) {
                     row += ' '
                 }

[NoCoverage] ArithmeticOperator
src/find-month-calendar.js:28:24
             let row = ''
             for (i = 0; i < 7 && dates.length !== 0; i++) {
                 row += dates.shift()
-                while (row.length % 4 !== 0) {
+                while (row.length * 4 !== 0) {
                     row += ' '
                 }

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:33:17
                 }
             }
             output(row)
-            if (dates.length === 0) break
+            if (true) break
         }
     }

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:33:17
                 }
             }
             output(row)
-            if (dates.length === 0) break
+            if (false) break
         }
     }

[Killed] BlockStatement
src/find-month-calendar.js:37:21
         }
     }
 
-    parseDate(date) {
-        const dateAr = []
-        let block = ''
-        let i
-        for (i = 0; i < date.length; i++) {
-            if (date[i] === '/') {
-                dateAr.push(parseInt(block))
-                block = ''
-                continue
-            }
-            block += date[i]
-        }
-        dateAr.push(parseInt(block))
-        if (dateAr.length !== 2) throw new Error('Improper string encoding')
-        const dateOb = { month: dateAr[0], year: dateAr[1] }
-        return dateOb
-    }
+    parseDate(date) {}
 
     isGreater(startDate, endDate) {
killedBy: Month Calendar Tests should parse date correctly
statusReason: expected undefined to deeply equal { month: 12, year: 2021 }

[Killed] ConditionalExpression
src/find-month-calendar.js:41:21
         const dateAr = []
         let block = ''
         let i
-        for (i = 0; i < date.length; i++) {
+        for (i = 0; false; i++) {
             if (date[i] === '/') {
                 dateAr.push(parseInt(block))
killedBy: Month Calendar Tests should parse date correctly
statusReason: Improper string encoding

[Killed] BlockStatement
src/find-month-calendar.js:41:43
         const dateAr = []
         let block = ''
         let i
-        for (i = 0; i < date.length; i++) {
-            if (date[i] === '/') {
-                dateAr.push(parseInt(block))
-                block = ''
-                continue
-            }
-            block += date[i]
-        }
+        for (i = 0; i < date.length; i++) {}
         dateAr.push(parseInt(block))
         if (dateAr.length !== 2) throw new Error('Improper string encoding')
killedBy: Month Calendar Tests should parse date correctly
statusReason: Improper string encoding

[Killed] EqualityOperator
src/find-month-calendar.js:42:17
         let block = ''
         let i
         for (i = 0; i < date.length; i++) {
-            if (date[i] === '/') {
+            if (date[i] !== '/') {
                 dateAr.push(parseInt(block))
                 block = ''
killedBy: Month Calendar Tests should parse date correctly
statusReason: Improper string encoding

[Killed] ConditionalExpression
src/find-month-calendar.js:42:17
         let block = ''
         let i
         for (i = 0; i < date.length; i++) {
-            if (date[i] === '/') {
+            if (false) {
                 dateAr.push(parseInt(block))
                 block = ''
killedBy: Month Calendar Tests should parse date correctly
statusReason: Improper string encoding

[Killed] AssignmentOperator
src/find-month-calendar.js:47:13
                 block = ''
                 continue
             }
-            block += date[i]
+            block -= date[i]
         }
         dateAr.push(parseInt(block))
killedBy: Month Calendar Tests should parse date correctly
statusReason: expected { month: -3, year: -5 } to deeply equal { month: 12, year: 2021 }

[Killed] ConditionalExpression
src/find-month-calendar.js:50:13
             block += date[i]
         }
         dateAr.push(parseInt(block))
-        if (dateAr.length !== 2) throw new Error('Improper string encoding')
+        if (true) throw new Error('Improper string encoding')
         const dateOb = { month: dateAr[0], year: dateAr[1] }
         return dateOb
killedBy: Month Calendar Tests should parse date correctly
statusReason: Improper string encoding

[Killed] ConditionalExpression
src/find-month-calendar.js:50:13
             block += date[i]
         }
         dateAr.push(parseInt(block))
-        if (dateAr.length !== 2) throw new Error('Improper string encoding')
+        if (false) throw new Error('Improper string encoding')
         const dateOb = { month: dateAr[0], year: dateAr[1] }
         return dateOb
killedBy: Month Calendar Tests should throw error for invalid date format
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/find-month-calendar.js:55:35
         return dateOb
     }
 
-    isGreater(startDate, endDate) {
-        if (startDate.year > endDate.year) {
-            return true
-        } else if (startDate.year < endDate.year) {
-            return false
-        } else if (startDate.month > endDate.month) {
-            return true
-        } else if (startDate.month < endDate.month) {
-            return false
-        }
-        return true
-    }
+    isGreater(startDate, endDate) {}
 
     getDayDiff(startDate, endDate) {
killedBy: Month Calendar Tests should correctly identify if start date is greater than end date
statusReason: expected undefined to be true

[Killed] EqualityOperator
src/find-month-calendar.js:56:13
     }
 
     isGreater(startDate, endDate) {
-        if (startDate.year > endDate.year) {
+        if (startDate.year >= endDate.year) {
             return true
         } else if (startDate.year < endDate.year) {
killedBy: Month Calendar Tests should correctly identify if start date is not greater than end date
statusReason: expected true to be false

[Survived] ConditionalExpression
src/find-month-calendar.js:56:13
     }
 
     isGreater(startDate, endDate) {
-        if (startDate.year > endDate.year) {
+        if (false) {
             return true
         } else if (startDate.year < endDate.year) {

[NoCoverage] BooleanLiteral
src/find-month-calendar.js:57:20
 
     isGreater(startDate, endDate) {
         if (startDate.year > endDate.year) {
-            return true
+            return false
         } else if (startDate.year < endDate.year) {
             return false

[Killed] ConditionalExpression
src/find-month-calendar.js:58:20
     isGreater(startDate, endDate) {
         if (startDate.year > endDate.year) {
             return true
-        } else if (startDate.year < endDate.year) {
+        } else if (true) {
             return false
         } else if (startDate.month > endDate.month) {
killedBy: Month Calendar Tests should correctly identify if start date is greater than end date
statusReason: expected false to be true

[Killed] EqualityOperator
src/find-month-calendar.js:58:20
     isGreater(startDate, endDate) {
         if (startDate.year > endDate.year) {
             return true
-        } else if (startDate.year < endDate.year) {
+        } else if (startDate.year <= endDate.year) {
             return false
         } else if (startDate.month > endDate.month) {
killedBy: Month Calendar Tests should correctly identify if start date is greater than end date
statusReason: expected false to be true

[Timeout] BooleanLiteral
src/find-month-calendar.js:59:20
         if (startDate.year > endDate.year) {
             return true
         } else if (startDate.year < endDate.year) {
-            return false
+            return true
         } else if (startDate.month > endDate.month) {
             return true

[Killed] EqualityOperator
src/find-month-calendar.js:60:20
             return true
         } else if (startDate.year < endDate.year) {
             return false
-        } else if (startDate.month > endDate.month) {
+        } else if (startDate.month <= endDate.month) {
             return true
         } else if (startDate.month < endDate.month) {
killedBy: Month Calendar Tests should correctly identify if start date is not greater than end date
statusReason: expected true to be false

[Killed] ConditionalExpression
src/find-month-calendar.js:60:20
             return true
         } else if (startDate.year < endDate.year) {
             return false
-        } else if (startDate.month > endDate.month) {
+        } else if (true) {
             return true
         } else if (startDate.month < endDate.month) {
killedBy: Month Calendar Tests should correctly identify if start date is not greater than end date
statusReason: expected true to be false

[Killed] BooleanLiteral
src/find-month-calendar.js:61:20
         } else if (startDate.year < endDate.year) {
             return false
         } else if (startDate.month > endDate.month) {
-            return true
+            return false
         } else if (startDate.month < endDate.month) {
             return false
killedBy: Month Calendar Tests should correctly identify if start date is greater than end date
statusReason: expected false to be true

[Killed] EqualityOperator
src/find-month-calendar.js:62:20
             return false
         } else if (startDate.month > endDate.month) {
             return true
-        } else if (startDate.month < endDate.month) {
+        } else if (startDate.month >= endDate.month) {
             return false
         }
killedBy: Month Calendar Tests should correctly identify if start date is not greater than end date
statusReason: expected true to be false

[Killed] ConditionalExpression
src/find-month-calendar.js:62:20
             return false
         } else if (startDate.month > endDate.month) {
             return true
-        } else if (startDate.month < endDate.month) {
+        } else if (false) {
             return false
         }
killedBy: Month Calendar Tests should correctly identify if start date is not greater than end date
statusReason: expected true to be false

[Killed] BooleanLiteral
src/find-month-calendar.js:63:20
         } else if (startDate.month > endDate.month) {
             return true
         } else if (startDate.month < endDate.month) {
-            return false
+            return true
         }
         return true
killedBy: Month Calendar Tests should correctly identify if start date is not greater than end date
statusReason: expected true to be false

[Killed] ConditionalExpression
src/find-month-calendar.js:69:13
     }
 
     getDayDiff(startDate, endDate) {
-        if (this.isGreater(startDate, endDate) === null) {
+        if (true) {
             return 0
         } else if (this.isGreater(startDate, endDate) === true) {
killedBy: Month Calendar Tests should calculate day difference correctly
statusReason: expected +0 to equal 365

[Killed] EqualityOperator
src/find-month-calendar.js:69:13
     }
 
     getDayDiff(startDate, endDate) {
-        if (this.isGreater(startDate, endDate) === null) {
+        if (this.isGreater(startDate, endDate) !== null) {
             return 0
         } else if (this.isGreater(startDate, endDate) === true) {
killedBy: Month Calendar Tests should calculate day difference correctly
statusReason: expected +0 to equal 365

[NoCoverage] BlockStatement
src/find-month-calendar.js:71:65
     getDayDiff(startDate, endDate) {
         if (this.isGreater(startDate, endDate) === null) {
             return 0
-        } else if (this.isGreater(startDate, endDate) === true) {
-            const midDate = startDate
-            startDate = endDate
-            endDate = midDate
-        }
+        } else if (this.isGreater(startDate, endDate) === true) {}
         let diff = 0
         while (startDate.year !== endDate.year) {

[Timeout] BooleanLiteral
src/find-month-calendar.js:71:59
     getDayDiff(startDate, endDate) {
         if (this.isGreater(startDate, endDate) === null) {
             return 0
-        } else if (this.isGreater(startDate, endDate) === true) {
+        } else if (this.isGreater(startDate, endDate) === false) {
             const midDate = startDate
             startDate = endDate

[Killed] ConditionalExpression
src/find-month-calendar.js:77:16
             endDate = midDate
         }
         let diff = 0
-        while (startDate.year !== endDate.year) {
+        while (false) {
             diff += this.isLeapYear(startDate.year) ? 366 : 365
             startDate.year = startDate.year + 1
killedBy: Month Calendar Tests should calculate day difference correctly
statusReason: expected +0 to equal 365

[Killed] EqualityOperator
src/find-month-calendar.js:77:16
             endDate = midDate
         }
         let diff = 0
-        while (startDate.year !== endDate.year) {
+        while (startDate.year === endDate.year) {
             diff += this.isLeapYear(startDate.year) ? 366 : 365
             startDate.year = startDate.year + 1
killedBy: Month Calendar Tests should calculate day difference correctly
statusReason: expected +0 to equal 365

[Killed] AssignmentOperator
src/find-month-calendar.js:78:13
         }
         let diff = 0
         while (startDate.year !== endDate.year) {
-            diff += this.isLeapYear(startDate.year) ? 366 : 365
+            diff -= this.isLeapYear(startDate.year) ? 366 : 365
             startDate.year = startDate.year + 1
         }
killedBy: Month Calendar Tests should calculate day difference correctly
statusReason: expected -365 to equal 365

[Timeout] ArithmeticOperator
src/find-month-calendar.js:79:30
         let diff = 0
         while (startDate.year !== endDate.year) {
             diff += this.isLeapYear(startDate.year) ? 366 : 365
-            startDate.year = startDate.year + 1
+            startDate.year = startDate.year - 1
         }
         while (startDate.month !== endDate.month) {

[Killed] EqualityOperator
src/find-month-calendar.js:81:16
             diff += this.isLeapYear(startDate.year) ? 366 : 365
             startDate.year = startDate.year + 1
         }
-        while (startDate.month !== endDate.month) {
+        while (startDate.month === endDate.month) {
             if (startDate.month < endDate.month) {
                 if (this.isLeapYear(startDate.year))
killedBy: Month Calendar Tests should calculate day difference correctly
statusReason: expected 334 to equal 365

[Survived] ConditionalExpression
src/find-month-calendar.js:81:16
             diff += this.isLeapYear(startDate.year) ? 366 : 365
             startDate.year = startDate.year + 1
         }
-        while (startDate.month !== endDate.month) {
+        while (false) {
             if (startDate.month < endDate.month) {
                 if (this.isLeapYear(startDate.year))

[NoCoverage] BlockStatement
src/find-month-calendar.js:82:50
             startDate.year = startDate.year + 1
         }
         while (startDate.month !== endDate.month) {
-            if (startDate.month < endDate.month) {
-                if (this.isLeapYear(startDate.year))
-                    diff += this.monthDaysLeap[startDate.month]
-                else diff += this.monthDays[startDate.month]
-                startDate.month = startDate.month + 1
-            } else {
+            if (startDate.month < endDate.month) {} else {
                 if (this.isLeapYear(startDate.year))
                     diff -= this.monthDaysLeap[startDate.month - 1]

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:82:17
             startDate.year = startDate.year + 1
         }
         while (startDate.month !== endDate.month) {
-            if (startDate.month < endDate.month) {
+            if (false) {
                 if (this.isLeapYear(startDate.year))
                     diff += this.monthDaysLeap[startDate.month]

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:83:21
         }
         while (startDate.month !== endDate.month) {
             if (startDate.month < endDate.month) {
-                if (this.isLeapYear(startDate.year))
+                if (true)
                     diff += this.monthDaysLeap[startDate.month]
                 else diff += this.monthDays[startDate.month]

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:83:21
         }
         while (startDate.month !== endDate.month) {
             if (startDate.month < endDate.month) {
-                if (this.isLeapYear(startDate.year))
+                if (false)
                     diff += this.monthDaysLeap[startDate.month]
                 else diff += this.monthDays[startDate.month]

[NoCoverage] AssignmentOperator
src/find-month-calendar.js:84:21
         while (startDate.month !== endDate.month) {
             if (startDate.month < endDate.month) {
                 if (this.isLeapYear(startDate.year))
-                    diff += this.monthDaysLeap[startDate.month]
+                    diff -= this.monthDaysLeap[startDate.month]
                 else diff += this.monthDays[startDate.month]
                 startDate.month = startDate.month + 1

[NoCoverage] AssignmentOperator
src/find-month-calendar.js:85:22
             if (startDate.month < endDate.month) {
                 if (this.isLeapYear(startDate.year))
                     diff += this.monthDaysLeap[startDate.month]
-                else diff += this.monthDays[startDate.month]
+                else diff -= this.monthDays[startDate.month]
                 startDate.month = startDate.month + 1
             } else {

[NoCoverage] ArithmeticOperator
src/find-month-calendar.js:86:35
                 if (this.isLeapYear(startDate.year))
                     diff += this.monthDaysLeap[startDate.month]
                 else diff += this.monthDays[startDate.month]
-                startDate.month = startDate.month + 1
+                startDate.month = startDate.month - 1
             } else {
                 if (this.isLeapYear(startDate.year))

[NoCoverage] BlockStatement
src/find-month-calendar.js:87:20
                     diff += this.monthDaysLeap[startDate.month]
                 else diff += this.monthDays[startDate.month]
                 startDate.month = startDate.month + 1
-            } else {
-                if (this.isLeapYear(startDate.year))
-                    diff -= this.monthDaysLeap[startDate.month - 1]
-                else diff -= this.monthDays[startDate.month - 1]
-                startDate.month = startDate.month - 1
-            }
+            } else {}
         }
         return diff

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:88:21
                 else diff += this.monthDays[startDate.month]
                 startDate.month = startDate.month + 1
             } else {
-                if (this.isLeapYear(startDate.year))
+                if (true)
                     diff -= this.monthDaysLeap[startDate.month - 1]
                 else diff -= this.monthDays[startDate.month - 1]

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:88:21
                 else diff += this.monthDays[startDate.month]
                 startDate.month = startDate.month + 1
             } else {
-                if (this.isLeapYear(startDate.year))
+                if (false)
                     diff -= this.monthDaysLeap[startDate.month - 1]
                 else diff -= this.monthDays[startDate.month - 1]

[NoCoverage] ArithmeticOperator
src/find-month-calendar.js:89:48
                 startDate.month = startDate.month + 1
             } else {
                 if (this.isLeapYear(startDate.year))
-                    diff -= this.monthDaysLeap[startDate.month - 1]
+                    diff -= this.monthDaysLeap[startDate.month + 1]
                 else diff -= this.monthDays[startDate.month - 1]
                 startDate.month = startDate.month - 1

[NoCoverage] AssignmentOperator
src/find-month-calendar.js:89:21
                 startDate.month = startDate.month + 1
             } else {
                 if (this.isLeapYear(startDate.year))
-                    diff -= this.monthDaysLeap[startDate.month - 1]
+                    diff += this.monthDaysLeap[startDate.month - 1]
                 else diff -= this.monthDays[startDate.month - 1]
                 startDate.month = startDate.month - 1

[NoCoverage] AssignmentOperator
src/find-month-calendar.js:90:22
             } else {
                 if (this.isLeapYear(startDate.year))
                     diff -= this.monthDaysLeap[startDate.month - 1]
-                else diff -= this.monthDays[startDate.month - 1]
+                else diff += this.monthDays[startDate.month - 1]
                 startDate.month = startDate.month - 1
             }

[NoCoverage] ArithmeticOperator
src/find-month-calendar.js:90:45
             } else {
                 if (this.isLeapYear(startDate.year))
                     diff -= this.monthDaysLeap[startDate.month - 1]
-                else diff -= this.monthDays[startDate.month - 1]
+                else diff -= this.monthDays[startDate.month + 1]
                 startDate.month = startDate.month - 1
             }

[NoCoverage] ArithmeticOperator
src/find-month-calendar.js:91:35
                 if (this.isLeapYear(startDate.year))
                     diff -= this.monthDaysLeap[startDate.month - 1]
                 else diff -= this.monthDays[startDate.month - 1]
-                startDate.month = startDate.month - 1
+                startDate.month = startDate.month + 1
             }
         }

[NoCoverage] BlockStatement
src/find-month-calendar.js:97:28
         return diff
     }
 
-    generateMonthCal(date) {
-        const Month = this.parseDate(date)
-        let day = ''
-        let difference = this.getDayDiff(this.epoch, Month)
-        difference = difference % 7
-        let Month2 = this.parseDate(date)
-        day = this.isGreater(Month2, this.epoch)
-            ? this.Days[difference]
-            : this.BDays[difference]
-        Month2 = this.parseDate(date)
-        if (this.isLeapYear(Month2.year))
-            this.printCal(this.monthDaysLeap[Month2.month], day)
-        else this.printCal(this.monthDays[Month2.month], day)
-    }
+    generateMonthCal(date) {}
 }
 

[NoCoverage] ArithmeticOperator
src/find-month-calendar.js:101:22
         const Month = this.parseDate(date)
         let day = ''
         let difference = this.getDayDiff(this.epoch, Month)
-        difference = difference % 7
+        difference = difference * 7
         let Month2 = this.parseDate(date)
         day = this.isGreater(Month2, this.epoch)
