[NoCoverage] ConditionalExpression
src/find-month-calendar.js:107:13
             ? this.Days[difference]
             : this.BDays[difference]
         Month2 = this.parseDate(date)
-        if (this.isLeapYear(Month2.year))
+        if (false)
             this.printCal(this.monthDaysLeap[Month2.month], day)
         else this.printCal(this.monthDays[Month2.month], day)

[NoCoverage] ConditionalExpression
src/find-month-calendar.js:107:13
             ? this.Days[difference]
             : this.BDays[difference]
         Month2 = this.parseDate(date)
-        if (this.isLeapYear(Month2.year))
+        if (true)
             this.printCal(this.monthDaysLeap[Month2.month], day)
         else this.printCal(this.monthDays[Month2.month], day)
