[Killed] BlockStatement
src/integrationSrc.js:13:23
     return a * b;
 }
 
-function divide(a, b) {
-    if (b === 0) {
-        throw new Error("Division by zero is not allowed.");
-    }
-    return a / b;
-}
+function divide(a, b) {}
 
 function complexMathCalculation(a, b, c, d) {
killedBy: Integration Tests should divide two numbers correctly
statusReason: expected undefined to equal 2

[Killed] ConditionalExpression
src/integrationSrc.js:14:9
 }
 
 function divide(a, b) {
-    if (b === 0) {
+    if (true) {
         throw new Error("Division by zero is not allowed.");
     }
killedBy: Integration Tests should divide two numbers correctly
statusReason: Division by zero is not allowed.

[Killed] BlockStatement
src/integrationSrc.js:20:45
     return a / b;
 }
 
-function complexMathCalculation(a, b, c, d) {
-    const sum = add(a, b);
-    const difference = subtract(c, d);
-    const product = multiply(sum, difference);
-    const result = divide(product, 2);
-    let finalResult = result;
-    
-    for (let i = 0; i < 5; i++) {
-        if (i % 2 === 0) {
-            finalResult = add(finalResult, i);
-        } else {
-            finalResult = subtract(finalResult, i);
-        }
-    }
-    return finalResult;
-}
+function complexMathCalculation(a, b, c, d) {}
 
 export { add, subtract, multiply, divide, complexMathCalculation };
killedBy: Integration Tests should perform a complex math calculation correctly
statusReason: expected undefined to equal -0.5

[Killed] EqualityOperator
src/integrationSrc.js:27:21
     const result = divide(product, 2);
     let finalResult = result;
     
-    for (let i = 0; i < 5; i++) {
+    for (let i = 0; i <= 5; i++) {
         if (i % 2 === 0) {
             finalResult = add(finalResult, i);
killedBy: Integration Tests should perform a complex math calculation correctly
statusReason: expected -5.5 to equal -0.5

[Killed] BlockStatement
src/integrationSrc.js:27:33
     const result = divide(product, 2);
     let finalResult = result;
     
-    for (let i = 0; i < 5; i++) {
-        if (i % 2 === 0) {
-            finalResult = add(finalResult, i);
-        } else {
-            finalResult = subtract(finalResult, i);
-        }
-    }
+    for (let i = 0; i < 5; i++) {}
     return finalResult;
 }
killedBy: Integration Tests should perform a complex math calculation correctly
statusReason: expected -2.5 to equal -0.5

[Killed] ArithmeticOperator
src/integrationSrc.js:28:13
     let finalResult = result;
     
     for (let i = 0; i < 5; i++) {
-        if (i % 2 === 0) {
+        if (i * 2 === 0) {
             finalResult = add(finalResult, i);
         } else {
killedBy: Integration Tests should perform a complex math calculation correctly
statusReason: expected -12.5 to equal -0.5

[Killed] ConditionalExpression
src/integrationSrc.js:28:13
     let finalResult = result;
     
     for (let i = 0; i < 5; i++) {
-        if (i % 2 === 0) {
+        if (false) {
             finalResult = add(finalResult, i);
         } else {
killedBy: Integration Tests should perform a complex math calculation correctly
statusReason: expected -12.5 to equal -0.5

[Killed] BlockStatement
src/integrationSrc.js:30:16
     for (let i = 0; i < 5; i++) {
         if (i % 2 === 0) {
             finalResult = add(finalResult, i);
-        } else {
-            finalResult = subtract(finalResult, i);
-        }
+        } else {}
     }
     return finalResult;
killedBy: Integration Tests should perform a complex math calculation correctly
statusReason: expected 3.5 to equal -0.5
