[Killed] ArithmeticOperator
src/searching.js:2:42
 class Searching {
-    binarySearch(arr, x, low = 0, high = arr.length - 1) {
+    binarySearch(arr, x, low = 0, high = arr.length + 1) {
         while (high >= low) {
             const mid = Math.floor(low + (high - low) / 2)
killedBy: Searching should find the index of the element using binary search
statusReason: expected 3 to equal 2

[Killed] BlockStatement
src/searching.js:2:58
 class Searching {
-    binarySearch(arr, x, low = 0, high = arr.length - 1) {
-        while (high >= low) {
-            const mid = Math.floor(low + (high - low) / 2)
-
-            if (arr[mid] === x) {
-                return mid
-            }
-
-            if (x < arr[mid]) {
-                high = mid - 1
-            } else {
-                low = mid + 1
-            }
-        }
-        return -1
-    }
+    binarySearch(arr, x, low = 0, high = arr.length - 1) {}
 
     linearSearch(theArray, key) {
killedBy: Searching should find the index of the element using binary search
statusReason: expected undefined to equal 2

[Killed] EqualityOperator
src/searching.js:3:16
 class Searching {
     binarySearch(arr, x, low = 0, high = arr.length - 1) {
-        while (high >= low) {
+        while (high > low) {
             const mid = Math.floor(low + (high - low) / 2)
 
killedBy: Searching should find the index of the last element
statusReason: expected -1 to equal 5

[Killed] EqualityOperator
src/searching.js:3:16
 class Searching {
     binarySearch(arr, x, low = 0, high = arr.length - 1) {
-        while (high >= low) {
+        while (high < low) {
             const mid = Math.floor(low + (high - low) / 2)
 
killedBy: Searching should find the index of the element using binary search
statusReason: expected -1 to equal 2

[Killed] ArithmeticOperator
src/searching.js:4:43
 class Searching {
     binarySearch(arr, x, low = 0, high = arr.length - 1) {
         while (high >= low) {
-            const mid = Math.floor(low + (high - low) / 2)
+            const mid = Math.floor(low + (high + low) / 2)
 
             if (arr[mid] === x) {
killedBy: Searching should find the index of the last element
statusReason: expected -1 to equal 5

[Killed] ArithmeticOperator
src/searching.js:4:42
 class Searching {
     binarySearch(arr, x, low = 0, high = arr.length - 1) {
         while (high >= low) {
-            const mid = Math.floor(low + (high - low) / 2)
+            const mid = Math.floor(low + (high - low) * 2)
 
             if (arr[mid] === x) {
killedBy: Searching should find the index of the element using binary search
statusReason: expected -1 to equal 2

[Killed] ConditionalExpression
src/searching.js:6:17
         while (high >= low) {
             const mid = Math.floor(low + (high - low) / 2)
 
-            if (arr[mid] === x) {
+            if (false) {
                 return mid
             }
killedBy: Searching should find the index of the element using binary search
statusReason: expected -1 to equal 2

[Killed] EqualityOperator
src/searching.js:6:17
         while (high >= low) {
             const mid = Math.floor(low + (high - low) / 2)
 
-            if (arr[mid] === x) {
+            if (arr[mid] !== x) {
                 return mid
             }
killedBy: Searching should find the index of the element using binary search
statusReason: expected 4 to equal 2

[Killed] ConditionalExpression
src/searching.js:10:17
                 return mid
             }
 
-            if (x < arr[mid]) {
+            if (true) {
                 high = mid - 1
             } else {
killedBy: Searching should find the index of the last element
statusReason: expected -1 to equal 5

[Killed] ConditionalExpression
src/searching.js:10:17
                 return mid
             }
 
-            if (x < arr[mid]) {
+            if (false) {
                 high = mid - 1
             } else {
killedBy: Searching should find the index of the first element
statusReason: expected -1 to equal +0

[Timeout] ArithmeticOperator
src/searching.js:11:24
             }
 
             if (x < arr[mid]) {
-                high = mid - 1
+                high = mid + 1
             } else {
                 low = mid + 1

[Timeout] BlockStatement
src/searching.js:12:20
 
             if (x < arr[mid]) {
                 high = mid - 1
-            } else {
-                low = mid + 1
-            }
+            } else {}
         }
         return -1

[Timeout] ArithmeticOperator
src/searching.js:13:23
             if (x < arr[mid]) {
                 high = mid - 1
             } else {
-                low = mid + 1
+                low = mid - 1
             }
         }

[NoCoverage] BlockStatement
src/searching.js:19:33
         return -1
     }
 
-    linearSearch(theArray, key) {
-        for (let n = 0; n < theArray.length; n++) {
-          if (theArray[n] === key) {
-            return n
-          }
-        }
-        return -1
-      }
+    linearSearch(theArray, key) {}
 }
 

[NoCoverage] EqualityOperator
src/searching.js:20:25
     }
 
     linearSearch(theArray, key) {
-        for (let n = 0; n < theArray.length; n++) {
+        for (let n = 0; n >= theArray.length; n++) {
           if (theArray[n] === key) {
             return n

[NoCoverage] EqualityOperator
src/searching.js:20:25
     }
 
     linearSearch(theArray, key) {
-        for (let n = 0; n < theArray.length; n++) {
+        for (let n = 0; n <= theArray.length; n++) {
           if (theArray[n] === key) {
             return n

[NoCoverage] ConditionalExpression
src/searching.js:21:15
 
     linearSearch(theArray, key) {
         for (let n = 0; n < theArray.length; n++) {
-          if (theArray[n] === key) {
+          if (true) {
             return n
           }

[NoCoverage] EqualityOperator
src/searching.js:21:15
 
     linearSearch(theArray, key) {
         for (let n = 0; n < theArray.length; n++) {
-          if (theArray[n] === key) {
+          if (theArray[n] !== key) {
             return n
           }
