[Killed] BooleanLiteral
src/simpson-integration.js:2:19
 function integralEvaluation(N, a, b, func) {
-    let isNEven = true
+    let isNEven = false
     if (N % 2 !== 0) isNEven = false
 
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got 'N is not an even number'

[Killed] EqualityOperator
src/simpson-integration.js:3:9
 function integralEvaluation(N, a, b, func) {
     let isNEven = true
-    if (N % 2 !== 0) isNEven = false
+    if (N % 2 === 0) isNEven = false
 
     if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
killedBy: integralEvaluation should throw Error if N is not even
statusReason: expected [Function] to throw Error

[Killed] ArithmeticOperator
src/simpson-integration.js:3:9
 function integralEvaluation(N, a, b, func) {
     let isNEven = true
-    if (N % 2 !== 0) isNEven = false
+    if (N * 2 !== 0) isNEven = false
 
     if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got 'N is not an even number'

[Killed] BlockStatement
src/simpson-integration.js:5:69
     let isNEven = true
     if (N % 2 !== 0) isNEven = false
 
-    if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
-        throw new TypeError('Expected integer N and finite a, b')
-    }
+    if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {}
     if (!isNEven) {
         throw Error('N is not an even number')
killedBy: integralEvaluation should throw TypeError if N is not an integer
statusReason: expected [Function] to throw 'TypeError' but 'Error: N is not an even number' was thrown

[Killed] LogicalOperator
src/simpson-integration.js:5:9
     let isNEven = true
     if (N % 2 !== 0) isNEven = false
 
-    if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
+    if ((!Number.isInteger(N) || Number.isNaN(a)) && Number.isNaN(b)) {
         throw new TypeError('Expected integer N and finite a, b')
     }
killedBy: integralEvaluation should throw TypeError if N is not an integer
statusReason: expected [Function] to throw 'TypeError' but 'Error: N is not an even number' was thrown

[Survived] StringLiteral
src/simpson-integration.js:6:29
     if (N % 2 !== 0) isNEven = false
 
     if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
-        throw new TypeError('Expected integer N and finite a, b')
+        throw new TypeError("")
     }
     if (!isNEven) {

[Killed] BlockStatement
src/simpson-integration.js:8:19
     if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
         throw new TypeError('Expected integer N and finite a, b')
     }
-    if (!isNEven) {
-        throw Error('N is not an even number')
-    }
+    if (!isNEven) {}
     if (N <= 0) {
         throw Error('N has to be >= 2')
killedBy: integralEvaluation should throw Error if N is not even
statusReason: expected [Function] to throw Error

[Killed] ConditionalExpression
src/simpson-integration.js:8:9
     if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
         throw new TypeError('Expected integer N and finite a, b')
     }
-    if (!isNEven) {
+    if (false) {
         throw Error('N is not an even number')
     }
killedBy: integralEvaluation should throw Error if N is not even
statusReason: expected [Function] to throw Error

[Killed] ConditionalExpression
src/simpson-integration.js:11:9
     if (!isNEven) {
         throw Error('N is not an even number')
     }
-    if (N <= 0) {
+    if (true) {
         throw Error('N has to be >= 2')
     }
killedBy: integralEvaluation should throw Error if a is greater than b
statusReason: expected [Function] to throw error including 'a must be less or equal than b' but got 'N has to be >= 2'

[Killed] ConditionalExpression
src/simpson-integration.js:11:9
     if (!isNEven) {
         throw Error('N is not an even number')
     }
-    if (N <= 0) {
+    if (false) {
         throw Error('N has to be >= 2')
     }
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got 'Result is NaN. The input interval doe…'

[Killed] StringLiteral
src/simpson-integration.js:12:21
         throw Error('N is not an even number')
     }
     if (N <= 0) {
-        throw Error('N has to be >= 2')
+        throw Error("")
     }
 
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got ''

[Killed] EqualityOperator
src/simpson-integration.js:15:9
         throw Error('N has to be >= 2')
     }
 
-    if (a > b) {
+    if (a >= b) {
         throw Error('a must be less or equal than b')
     }
killedBy: integralEvaluation should return 0 if a is equal to b
statusReason: a must be less or equal than b

[Killed] ConditionalExpression
src/simpson-integration.js:18:9
     if (a > b) {
         throw Error('a must be less or equal than b')
     }
-    if (a === b) return 0
+    if (true) return 0
 
     const h = (b - a) / N
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected +0 to be close to 2 +/- 0.01

[Killed] EqualityOperator
src/simpson-integration.js:18:9
     if (a > b) {
         throw Error('a must be less or equal than b')
     }
-    if (a === b) return 0
+    if (a !== b) return 0
 
     const h = (b - a) / N
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected +0 to be close to 2 +/- 0.01

[Killed] ArithmeticOperator
src/simpson-integration.js:20:15
     }
     if (a === b) return 0
 
-    const h = (b - a) / N
+    const h = (b - a) * N
 
     let xi = a 
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 2.688110056919238e-7 to be close to 2 +/- 0.01

[Survived] ArithmeticOperator
src/simpson-integration.js:20:16
     }
     if (a === b) return 0
 
-    const h = (b - a) / N
+    const h = (b + a) / N
 
     let xi = a 

[Killed] EqualityOperator
src/simpson-integration.js:26:21
     const pointsArray = []
 
     let temp
-    for (let i = 0; i < N + 1; i++) {
+    for (let i = 0; i <= N + 1; i++) {
         if (i === 0 || i === N) temp = func(xi)
         else if (i % 2 === 0) temp = 2 * func(xi)
killedBy: integralEvaluation should correctly evaluate the integral of x^2 from 0 to 1
statusReason: expected 0.34693466666666706 to be close to 0.3333333333333333 +/- 0.01

[Killed] EqualityOperator
src/simpson-integration.js:26:21
     const pointsArray = []
 
     let temp
-    for (let i = 0; i < N + 1; i++) {
+    for (let i = 0; i >= N + 1; i++) {
         if (i === 0 || i === N) temp = func(xi)
         else if (i % 2 === 0) temp = 2 * func(xi)
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected +0 to be close to 2 +/- 0.01

[Killed] EqualityOperator
src/simpson-integration.js:27:24
 
     let temp
     for (let i = 0; i < N + 1; i++) {
-        if (i === 0 || i === N) temp = func(xi)
+        if (i === 0 || i !== N) temp = func(xi)
         else if (i % 2 === 0) temp = 2 * func(xi)
         else temp = 4 * func(xi)
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 0.6666118346291484 to be close to 2 +/- 0.01

[Killed] ConditionalExpression
src/simpson-integration.js:27:13
 
     let temp
     for (let i = 0; i < N + 1; i++) {
-        if (i === 0 || i === N) temp = func(xi)
+        if (true) temp = func(xi)
         else if (i % 2 === 0) temp = 2 * func(xi)
         else temp = 4 * func(xi)
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 0.6666118346291484 to be close to 2 +/- 0.01

[Killed] ConditionalExpression
src/simpson-integration.js:28:18
     let temp
     for (let i = 0; i < N + 1; i++) {
         if (i === 0 || i === N) temp = func(xi)
-        else if (i % 2 === 0) temp = 2 * func(xi)
+        else if (true) temp = 2 * func(xi)
         else temp = 4 * func(xi)
 
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 1.3332236692582966 to be close to 2 +/- 0.01

[Killed] ArithmeticOperator
src/simpson-integration.js:28:38
     let temp
     for (let i = 0; i < N + 1; i++) {
         if (i === 0 || i === N) temp = func(xi)
-        else if (i % 2 === 0) temp = 2 * func(xi)
+        else if (i % 2 === 0) temp = 2 / func(xi)
         else temp = 4 * func(xi)
 
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 4.025286774085441 to be close to 2 +/- 0.01

[Killed] ArithmeticOperator
src/simpson-integration.js:29:21
     for (let i = 0; i < N + 1; i++) {
         if (i === 0 || i === N) temp = func(xi)
         else if (i % 2 === 0) temp = 2 * func(xi)
-        else temp = 4 * func(xi)
+        else temp = 4 / func(xi)
 
         pointsArray.push(temp)
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 7.898417647050052 to be close to 2 +/- 0.01

[Killed] AssignmentOperator
src/simpson-integration.js:32:9
         else temp = 4 * func(xi)
 
         pointsArray.push(temp)
-        xi += h
+        xi -= h
     }
 
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected -2.000000010824506 to be close to 2 +/- 0.01

[Killed] ArithmeticOperator
src/simpson-integration.js:35:18
         xi += h
     }
 
-    let result = h / 3
+    let result = h * 3
     temp = pointsArray.reduce((acc, currValue) => acc + currValue, 0)
 
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 18.000000097420553 to be close to 2 +/- 0.01

[Killed] ArrowFunction
src/simpson-integration.js:36:31
     }
 
     let result = h / 3
-    temp = pointsArray.reduce((acc, currValue) => acc + currValue, 0)
+    temp = pointsArray.reduce(() => undefined, 0)
 
     result *= temp
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: Result is NaN. The input interval doesn't belong to the functions domain

[Killed] ArithmeticOperator
src/simpson-integration.js:36:51
     }
 
     let result = h / 3
-    temp = pointsArray.reduce((acc, currValue) => acc + currValue, 0)
+    temp = pointsArray.reduce((acc, currValue) => acc - currValue, 0)
 
     result *= temp
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected -2.000000010824506 to be close to 2 +/- 0.01

[Killed] AssignmentOperator
src/simpson-integration.js:38:5
     let result = h / 3
     temp = pointsArray.reduce((acc, currValue) => acc + currValue, 0)
 
-    result *= temp
+    result /= temp
 
     if (Number.isNaN(result)) {
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 0.00005483113526484758 to be close to 2 +/- 0.01

[Killed] ConditionalExpression
src/simpson-integration.js:40:9
 
     result *= temp
 
-    if (Number.isNaN(result)) {
+    if (true) {
         throw Error(
             "Result is NaN. The input interval doesn't belong to the functions domain"
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: Result is NaN. The input interval doesn't belong to the functions domain

[NoCoverage] BlockStatement
src/simpson-integration.js:40:31
 
     result *= temp
 
-    if (Number.isNaN(result)) {
-        throw Error(
-            "Result is NaN. The input interval doesn't belong to the functions domain"
-        )
-    }
+    if (Number.isNaN(result)) {}
 
     return result
