[Killed] BlockStatement
src/sorting.js:2:23
 class Sorting {
-    bubbleSort(items) {
-        const length = items.length
-        let noSwaps
-
-        for (let i = length; i > 0; i--) {
-            noSwaps = true
-            for (let j = 0; j < i - 1; j++) {
-                if (items[j] > items[j + 1]) {
-                    [items[j], items[j + 1]] = [items[j + 1], items[j]]
-                    noSwaps = false
-                }
-            }
-            if (noSwaps) {
-                break
-            }
-        }
-
-        return items
-    }
+    bubbleSort(items) {}
 
     secondLargestElement = (array) => {
killedBy: Sorting should sort the array using bubble sort
statusReason: expected undefined to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Survived] BooleanLiteral
src/sorting.js:7:23
         let noSwaps
 
         for (let i = length; i > 0; i--) {
-            noSwaps = true
+            noSwaps = false
             for (let j = 0; j < i - 1; j++) {
                 if (items[j] > items[j + 1]) {

[Killed] BlockStatement
src/sorting.js:8:45
 
         for (let i = length; i > 0; i--) {
             noSwaps = true
-            for (let j = 0; j < i - 1; j++) {
-                if (items[j] > items[j + 1]) {
-                    [items[j], items[j + 1]] = [items[j + 1], items[j]]
-                    noSwaps = false
-                }
-            }
+            for (let j = 0; j < i - 1; j++) {}
             if (noSwaps) {
                 break
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ConditionalExpression
src/sorting.js:8:29
 
         for (let i = length; i > 0; i--) {
             noSwaps = true
-            for (let j = 0; j < i - 1; j++) {
+            for (let j = 0; false; j++) {
                 if (items[j] > items[j + 1]) {
                     [items[j], items[j + 1]] = [items[j + 1], items[j]]
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/sorting.js:9:38
         for (let i = length; i > 0; i--) {
             noSwaps = true
             for (let j = 0; j < i - 1; j++) {
-                if (items[j] > items[j + 1]) {
+                if (items[j] > items[j - 1]) {
                     [items[j], items[j + 1]] = [items[j + 1], items[j]]
                     noSwaps = false
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 5, 2, 1, 6, 5, 9 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ConditionalExpression
src/sorting.js:9:21
         for (let i = length; i > 0; i--) {
             noSwaps = true
             for (let j = 0; j < i - 1; j++) {
-                if (items[j] > items[j + 1]) {
+                if (false) {
                     [items[j], items[j + 1]] = [items[j + 1], items[j]]
                     noSwaps = false
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/sorting.js:10:38
             noSwaps = true
             for (let j = 0; j < i - 1; j++) {
                 if (items[j] > items[j + 1]) {
-                    [items[j], items[j + 1]] = [items[j + 1], items[j]]
+                    [items[j], items[j - 1]] = [items[j + 1], items[j]]
                     noSwaps = false
                 }
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 1, 1, 1, 1, 5, 6, …(1) ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/sorting.js:10:55
             noSwaps = true
             for (let j = 0; j < i - 1; j++) {
                 if (items[j] > items[j + 1]) {
-                    [items[j], items[j + 1]] = [items[j + 1], items[j]]
+                    [items[j], items[j + 1]] = [items[j - 1], items[j]]
                     noSwaps = false
                 }
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ undefined, 5, 5, 5, 5, 9 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] BooleanLiteral
src/sorting.js:11:31
             for (let j = 0; j < i - 1; j++) {
                 if (items[j] > items[j + 1]) {
                     [items[j], items[j + 1]] = [items[j + 1], items[j]]
-                    noSwaps = false
+                    noSwaps = true
                 }
             }
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 2, 5, 1, 5, 6, 9 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[NoCoverage] BlockStatement
src/sorting.js:22:39
         return items
     }
 
-    secondLargestElement = (array) => {
-        const largestElement = Math.max(...array)
-        let element = -Number.MAX_VALUE
-      
-        for (let i = 0; i < array.length; i++) {
-          if (element < array[i] && array[i] !== largestElement) {
-            element = array[i]
-          }
-        }
-      
-        return element
-      }
+    secondLargestElement = (array) => {}
     
 }

[NoCoverage] MethodExpression
src/sorting.js:23:32
     }
 
     secondLargestElement = (array) => {
-        const largestElement = Math.max(...array)
+        const largestElement = Math.min(...array)
         let element = -Number.MAX_VALUE
       

[NoCoverage] UnaryOperator
src/sorting.js:24:23
 
     secondLargestElement = (array) => {
         const largestElement = Math.max(...array)
-        let element = -Number.MAX_VALUE
+        let element = +Number.MAX_VALUE
       
         for (let i = 0; i < array.length; i++) {

[NoCoverage] ConditionalExpression
src/sorting.js:26:25
         const largestElement = Math.max(...array)
         let element = -Number.MAX_VALUE
       
-        for (let i = 0; i < array.length; i++) {
+        for (let i = 0; false; i++) {
           if (element < array[i] && array[i] !== largestElement) {
             element = array[i]

[NoCoverage] EqualityOperator
src/sorting.js:26:25
         const largestElement = Math.max(...array)
         let element = -Number.MAX_VALUE
       
-        for (let i = 0; i < array.length; i++) {
+        for (let i = 0; i >= array.length; i++) {
           if (element < array[i] && array[i] !== largestElement) {
             element = array[i]

[NoCoverage] ConditionalExpression
src/sorting.js:27:37
         let element = -Number.MAX_VALUE
       
         for (let i = 0; i < array.length; i++) {
-          if (element < array[i] && array[i] !== largestElement) {
+          if (element < array[i] && true) {
             element = array[i]
           }

[NoCoverage] LogicalOperator
src/sorting.js:27:15
         let element = -Number.MAX_VALUE
       
         for (let i = 0; i < array.length; i++) {
-          if (element < array[i] && array[i] !== largestElement) {
+          if (element < array[i] || array[i] !== largestElement) {
             element = array[i]
           }
