[Killed] BlockStatement
src/validate-credit-card.js:1:46
-const luhnValidation = (creditCardNumber) => {
-    let validationSum = 0
-    creditCardNumber.split('').forEach((digit, index) => {
-        let currentDigit = parseInt(digit)
-        if (index % 2 === 0) {
-            currentDigit *= 2
-            if (currentDigit > 9) {
-                currentDigit %= 10
-                currentDigit += 1
-            }
-        }
-        validationSum += currentDigit
-    })
-
-    return validationSum % 10 === 0
-}
+const luhnValidation = (creditCardNumber) => {}
 
 const validateCreditCard = (creditCardString) => {
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] BlockStatement
src/validate-credit-card.js:3:58
 const luhnValidation = (creditCardNumber) => {
     let validationSum = 0
-    creditCardNumber.split('').forEach((digit, index) => {
-        let currentDigit = parseInt(digit)
-        if (index % 2 === 0) {
-            currentDigit *= 2
-            if (currentDigit > 9) {
-                currentDigit %= 10
-                currentDigit += 1
-            }
-        }
-        validationSum += currentDigit
-    })
+    creditCardNumber.split('').forEach((digit, index) => {})
 
     return validationSum % 10 === 0
killedBy: validateCreditCard should throw an error for a card number that fails the Luhn check
statusReason: expected [Function] to throw Error

[Killed] EqualityOperator
src/validate-credit-card.js:5:13
     let validationSum = 0
     creditCardNumber.split('').forEach((digit, index) => {
         let currentDigit = parseInt(digit)
-        if (index % 2 === 0) {
+        if (index % 2 !== 0) {
             currentDigit *= 2
             if (currentDigit > 9) {
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] ConditionalExpression
src/validate-credit-card.js:5:13
     let validationSum = 0
     creditCardNumber.split('').forEach((digit, index) => {
         let currentDigit = parseInt(digit)
-        if (index % 2 === 0) {
+        if (true) {
             currentDigit *= 2
             if (currentDigit > 9) {
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] AssignmentOperator
src/validate-credit-card.js:6:13
     creditCardNumber.split('').forEach((digit, index) => {
         let currentDigit = parseInt(digit)
         if (index % 2 === 0) {
-            currentDigit *= 2
+            currentDigit /= 2
             if (currentDigit > 9) {
                 currentDigit %= 10
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] ConditionalExpression
src/validate-credit-card.js:7:17
         let currentDigit = parseInt(digit)
         if (index % 2 === 0) {
             currentDigit *= 2
-            if (currentDigit > 9) {
+            if (false) {
                 currentDigit %= 10
                 currentDigit += 1
killedBy: validateCreditCard should return true for a valid MasterCard number
statusReason: 5500000000000004 is an invalid credit card number because it fails the Luhn check.

[Killed] BlockStatement
src/validate-credit-card.js:7:35
         let currentDigit = parseInt(digit)
         if (index % 2 === 0) {
             currentDigit *= 2
-            if (currentDigit > 9) {
-                currentDigit %= 10
-                currentDigit += 1
-            }
+            if (currentDigit > 9) {}
         }
         validationSum += currentDigit
killedBy: validateCreditCard should return true for a valid MasterCard number
statusReason: 5500000000000004 is an invalid credit card number because it fails the Luhn check.

[Survived] AssignmentOperator
src/validate-credit-card.js:8:17
         if (index % 2 === 0) {
             currentDigit *= 2
             if (currentDigit > 9) {
-                currentDigit %= 10
+                currentDigit *= 10
                 currentDigit += 1
             }

[Killed] AssignmentOperator
src/validate-credit-card.js:9:17
             currentDigit *= 2
             if (currentDigit > 9) {
                 currentDigit %= 10
-                currentDigit += 1
+                currentDigit -= 1
             }
         }
killedBy: validateCreditCard should return true for a valid MasterCard number
statusReason: 5500000000000004 is an invalid credit card number because it fails the Luhn check.

[Survived] AssignmentOperator
src/validate-credit-card.js:12:9
                 currentDigit += 1
             }
         }
-        validationSum += currentDigit
+        validationSum -= currentDigit
     })
 

[Killed] ArithmeticOperator
src/validate-credit-card.js:15:12
         validationSum += currentDigit
     })
 
-    return validationSum % 10 === 0
+    return validationSum * 10 === 0
 }
 
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] ConditionalExpression
src/validate-credit-card.js:15:12
         validationSum += currentDigit
     })
 
-    return validationSum % 10 === 0
+    return true
 }
 
killedBy: validateCreditCard should throw an error for a card number that fails the Luhn check
statusReason: expected [Function] to throw Error

[Killed] StringLiteral
src/validate-credit-card.js:19:49
 }
 
 const validateCreditCard = (creditCardString) => {
-    const validStartSubString = ['4', '5', '6', '37', '34', '35'] 
+    const validStartSubString = ['4', '5', '6', "", '34', '35'] 
 
     if (typeof creditCardString !== 'string') {
killedBy: validateCreditCard should throw an error for a card number with invalid starting digits
statusReason: expected [Function] to throw error including '9111111111111111 is an invalid credit…' but got '9111111111111111 is an invalid credit…'

[Killed] StringLiteral
src/validate-credit-card.js:19:44
 }
 
 const validateCreditCard = (creditCardString) => {
-    const validStartSubString = ['4', '5', '6', '37', '34', '35'] 
+    const validStartSubString = ['4', '5', "", '37', '34', '35'] 
 
     if (typeof creditCardString !== 'string') {
killedBy: validateCreditCard should throw an error for a card number with invalid starting digits
statusReason: expected [Function] to throw error including '9111111111111111 is an invalid credit…' but got '9111111111111111 is an invalid credit…'

[Killed] ConditionalExpression
src/validate-credit-card.js:21:9
 const validateCreditCard = (creditCardString) => {
     const validStartSubString = ['4', '5', '6', '37', '34', '35'] 
 
-    if (typeof creditCardString !== 'string') {
+    if (true) {
         throw new TypeError('The given value is not a string')
     }
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: The given value is not a string

[Killed] EqualityOperator
src/validate-credit-card.js:21:9
 const validateCreditCard = (creditCardString) => {
     const validStartSubString = ['4', '5', '6', '37', '34', '35'] 
 
-    if (typeof creditCardString !== 'string') {
+    if (typeof creditCardString === 'string') {
         throw new TypeError('The given value is not a string')
     }
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: The given value is not a string

[Killed] StringLiteral
src/validate-credit-card.js:25:26
         throw new TypeError('The given value is not a string')
     }
 
-    const errorMessage = `${creditCardString} is an invalid credit card number because `
+    const errorMessage = ``
     if (isNaN(creditCardString)) {
         throw new TypeError(errorMessage + 'it has nonnumerical characters.')
killedBy: validateCreditCard should throw an error for a card number with non-numerical characters
statusReason: expected [Function] to throw error including '4111a11111111111 is an invalid credit…' but got 'it has nonnumerical characters.'

[Killed] ConditionalExpression
src/validate-credit-card.js:26:9
     }
 
     const errorMessage = `${creditCardString} is an invalid credit card number because `
-    if (isNaN(creditCardString)) {
+    if (false) {
         throw new TypeError(errorMessage + 'it has nonnumerical characters.')
     }
killedBy: validateCreditCard should throw an error for a card number with non-numerical characters
statusReason: expected [Function] to throw 'TypeError' but 'Error: 4111a11111111111 is an invalid…' was thrown

[Killed] BlockStatement
src/validate-credit-card.js:26:34
     }
 
     const errorMessage = `${creditCardString} is an invalid credit card number because `
-    if (isNaN(creditCardString)) {
-        throw new TypeError(errorMessage + 'it has nonnumerical characters.')
-    }
+    if (isNaN(creditCardString)) {}
     const creditCardStringLength = creditCardString.length
     if (!(creditCardStringLength >= 13 && creditCardStringLength <= 16)) {
killedBy: validateCreditCard should throw an error for a card number with non-numerical characters
statusReason: expected [Function] to throw 'TypeError' but 'Error: 4111a11111111111 is an invalid…' was thrown

[Killed] StringLiteral
src/validate-credit-card.js:27:44
 
     const errorMessage = `${creditCardString} is an invalid credit card number because `
     if (isNaN(creditCardString)) {
-        throw new TypeError(errorMessage + 'it has nonnumerical characters.')
+        throw new TypeError(errorMessage + "")
     }
     const creditCardStringLength = creditCardString.length
killedBy: validateCreditCard should throw an error for a card number with non-numerical characters
statusReason: expected [Function] to throw error including '4111a11111111111 is an invalid credit…' but got '4111a11111111111 is an invalid credit…'

[Killed] ConditionalExpression
src/validate-credit-card.js:30:9
         throw new TypeError(errorMessage + 'it has nonnumerical characters.')
     }
     const creditCardStringLength = creditCardString.length
-    if (!(creditCardStringLength >= 13 && creditCardStringLength <= 16)) {
+    if (false) {
         throw new Error(errorMessage + 'of its length.')
     }
killedBy: validateCreditCard should throw an error for a card number with invalid length
statusReason: expected [Function] to throw error including '41111111111 is an invalid credit card…' but got '41111111111 is an invalid credit card…'

[Killed] BooleanLiteral
src/validate-credit-card.js:30:9
         throw new TypeError(errorMessage + 'it has nonnumerical characters.')
     }
     const creditCardStringLength = creditCardString.length
-    if (!(creditCardStringLength >= 13 && creditCardStringLength <= 16)) {
+    if (creditCardStringLength >= 13 && creditCardStringLength <= 16) {
         throw new Error(errorMessage + 'of its length.')
     }
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because of its length.

[Killed] ArrowFunction
src/validate-credit-card.js:34:35
         throw new Error(errorMessage + 'of its length.')
     }
     if (
-        !validStartSubString.some((subString) =>
-            creditCardString.startsWith(subString)
+        !validStartSubString.some(() => undefined
         )
     ) {
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because of its first two digits.

[Killed] ConditionalExpression
src/validate-credit-card.js:34:9
         throw new Error(errorMessage + 'of its length.')
     }
     if (
-        !validStartSubString.some((subString) =>
-            creditCardString.startsWith(subString)
-        )
+        false
     ) {
         throw new Error(errorMessage + 'of its first two digits.')
killedBy: validateCreditCard should throw an error for a card number with invalid starting digits
statusReason: expected [Function] to throw error including '9111111111111111 is an invalid credit…' but got '9111111111111111 is an invalid credit…'

[Killed] MethodExpression
src/validate-credit-card.js:35:13
     }
     if (
         !validStartSubString.some((subString) =>
-            creditCardString.startsWith(subString)
+            creditCardString.endsWith(subString)
         )
     ) {
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because of its first two digits.

[Killed] BlockStatement
src/validate-credit-card.js:37:7
         !validStartSubString.some((subString) =>
             creditCardString.startsWith(subString)
         )
-    ) {
-        throw new Error(errorMessage + 'of its first two digits.')
-    }
+    ) {}
     if (!luhnValidation(creditCardString)) {
         throw new Error(errorMessage + 'it fails the Luhn check.')
killedBy: validateCreditCard should throw an error for a card number with invalid starting digits
statusReason: expected [Function] to throw error including '9111111111111111 is an invalid credit…' but got '9111111111111111 is an invalid credit…'

[Killed] BooleanLiteral
src/validate-credit-card.js:40:9
     ) {
         throw new Error(errorMessage + 'of its first two digits.')
     }
-    if (!luhnValidation(creditCardString)) {
+    if (luhnValidation(creditCardString)) {
         throw new Error(errorMessage + 'it fails the Luhn check.')
     }
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] ConditionalExpression
src/validate-credit-card.js:40:9
     ) {
         throw new Error(errorMessage + 'of its first two digits.')
     }
-    if (!luhnValidation(creditCardString)) {
+    if (false) {
         throw new Error(errorMessage + 'it fails the Luhn check.')
     }
killedBy: validateCreditCard should throw an error for a card number that fails the Luhn check
statusReason: expected [Function] to throw Error
