[Killed] BlockStatement
src/catalan-numbers.js:1:31
-const catalanNumbers = (n) => {
-    if (n === 0) {
-        return [1]
-    }
-    const catList = [1, 1]
-
-    for (let i = 2; i <= n; i++) {
-        let newNumber = 0
-        for (let j = 0; j < i; j++) {
-            newNumber += catList[j] * catList[i - j - 1]
-        }
-        catList.push(newNumber)
-    }
-
-    return catList
-}
+const catalanNumbers = (n) => {}
 export default catalanNumbers;
killedBy: Catalan Numbers Tests should return [1] for n = 0
statusReason: expected undefined to deeply equal [ 1 ]

[Killed] ConditionalExpression
src/catalan-numbers.js:2:9
 const catalanNumbers = (n) => {
-    if (n === 0) {
+    if (true) {
         return [1]
     }
killedBy: Catalan Numbers Tests should return [1, 1] for n = 1
statusReason: expected [ 1 ] to deeply equal [ 1, 1 ]

[Killed] BlockStatement
src/catalan-numbers.js:2:18
 const catalanNumbers = (n) => {
-    if (n === 0) {
-        return [1]
-    }
+    if (n === 0) {}
     const catList = [1, 1]
 
killedBy: Catalan Numbers Tests should return [1] for n = 0
statusReason: expected [ 1, 1 ] to deeply equal [ 1 ]

[Killed] ConditionalExpression
src/catalan-numbers.js:7:21
     }
     const catList = [1, 1]
 
-    for (let i = 2; i <= n; i++) {
+    for (let i = 2; false; i++) {
         let newNumber = 0
         for (let j = 0; j < i; j++) {
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 2
statusReason: expected [ 1, 1 ] to deeply equal [ 1, 1, 2 ]

[Killed] EqualityOperator
src/catalan-numbers.js:7:21
     }
     const catList = [1, 1]
 
-    for (let i = 2; i <= n; i++) {
+    for (let i = 2; i < n; i++) {
         let newNumber = 0
         for (let j = 0; j < i; j++) {
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 2
statusReason: expected [ 1, 1 ] to deeply equal [ 1, 1, 2 ]

[Killed] ConditionalExpression
src/catalan-numbers.js:9:25
 
     for (let i = 2; i <= n; i++) {
         let newNumber = 0
-        for (let j = 0; j < i; j++) {
+        for (let j = 0; false; j++) {
             newNumber += catList[j] * catList[i - j - 1]
         }
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 2
statusReason: expected [ 1, 1, +0 ] to deeply equal [ 1, 1, 2 ]

[Killed] EqualityOperator
src/catalan-numbers.js:9:25
 
     for (let i = 2; i <= n; i++) {
         let newNumber = 0
-        for (let j = 0; j < i; j++) {
+        for (let j = 0; j <= i; j++) {
             newNumber += catList[j] * catList[i - j - 1]
         }
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 2
statusReason: expected [ 1, 1, NaN ] to deeply equal [ 1, 1, 2 ]

[Killed] AssignmentOperator
src/catalan-numbers.js:10:13
     for (let i = 2; i <= n; i++) {
         let newNumber = 0
         for (let j = 0; j < i; j++) {
-            newNumber += catList[j] * catList[i - j - 1]
+            newNumber -= catList[j] * catList[i - j - 1]
         }
         catList.push(newNumber)
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 2
statusReason: expected [ 1, 1, -2 ] to deeply equal [ 1, 1, 2 ]

[Killed] ArithmeticOperator
src/catalan-numbers.js:10:26
     for (let i = 2; i <= n; i++) {
         let newNumber = 0
         for (let j = 0; j < i; j++) {
-            newNumber += catList[j] * catList[i - j - 1]
+            newNumber += catList[j] / catList[i - j - 1]
         }
         catList.push(newNumber)
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 3
statusReason: expected [ 1, 1, 2, 3.5 ] to deeply equal [ 1, 1, 2, 5 ]
