[Killed] ArrowFunction
src/add.js:1:13
-const add = (a, b) => a + b;
+const add = () => undefined;
 
 export default add;
killedBy: add add test
statusReason: expected undefined to equal 5

[Killed] ArithmeticOperator
src/add.js:1:23
-const add = (a, b) => a + b;
+const add = (a, b) => a - b;
 
 export default add;
killedBy: add add test
statusReason: expected -3 to equal 5
