[Killed] BlockStatement
src/convex-hull-graham-scan.js:1:24
-function compare(a, b) {
-    if (a.x < b.x) return -1
-    if (a.x === b.x && a.y < b.y) return -1
-    return 1
-  }
+function compare(a, b) {}
   function orientation(a, b, c) {
     const alpha = (b.y - a.y) / (b.x - a.x)
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(6) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:2:9
 function compare(a, b) {
-    if (a.x < b.x) return -1
+    if (a.x <= b.x) return -1
     if (a.x === b.x && a.y < b.y) return -1
     return 1
killedBy: convexHull should handle points forming a square
statusReason: expected [ { x: 1, y: 1 }, …(3) ] to deeply equal [ { x: +0, y: 1 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:2:9
 function compare(a, b) {
-    if (a.x < b.x) return -1
+    if (true) return -1
     if (a.x === b.x && a.y < b.y) return -1
     return 1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(7) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:3:9
 function compare(a, b) {
     if (a.x < b.x) return -1
-    if (a.x === b.x && a.y < b.y) return -1
+    if (true) return -1
     return 1
   }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(7) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:3:9
 function compare(a, b) {
     if (a.x < b.x) return -1
-    if (a.x === b.x && a.y < b.y) return -1
+    if (true && a.y < b.y) return -1
     return 1
   }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(5) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] BlockStatement
src/convex-hull-graham-scan.js:6:33
     if (a.x === b.x && a.y < b.y) return -1
     return 1
   }
-  function orientation(a, b, c) {
-    const alpha = (b.y - a.y) / (b.x - a.x)
-    const beta = (c.y - b.y) / (c.x - b.x)
-  
-    if (alpha > beta) return 1
-    else if (beta > alpha) return -1
-    return 0
-  }
+  function orientation(a, b, c) {}
   
   function convexHull(points) {
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(13) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:7:34
     return 1
   }
   function orientation(a, b, c) {
-    const alpha = (b.y - a.y) / (b.x - a.x)
+    const alpha = (b.y - a.y) / (b.x + a.x)
     const beta = (c.y - b.y) / (c.x - b.x)
   
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:7:19
     return 1
   }
   function orientation(a, b, c) {
-    const alpha = (b.y - a.y) / (b.x - a.x)
+    const alpha = (b.y - a.y) * (b.x - a.x)
     const beta = (c.y - b.y) / (c.x - b.x)
   
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(5) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:8:19
   }
   function orientation(a, b, c) {
     const alpha = (b.y - a.y) / (b.x - a.x)
-    const beta = (c.y - b.y) / (c.x - b.x)
+    const beta = (c.y + b.y) / (c.x - b.x)
   
     if (alpha > beta) return 1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(5) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:8:33
   }
   function orientation(a, b, c) {
     const alpha = (b.y - a.y) / (b.x - a.x)
-    const beta = (c.y - b.y) / (c.x - b.x)
+    const beta = (c.y - b.y) / (c.x + b.x)
   
     if (alpha > beta) return 1
killedBy: convexHull should handle collinear points correctly
statusReason: expected [ Array(4) ] to deeply equal [ Array(6) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:10:9
     const alpha = (b.y - a.y) / (b.x - a.x)
     const beta = (c.y - b.y) / (c.x - b.x)
   
-    if (alpha > beta) return 1
+    if (alpha >= beta) return 1
     else if (beta > alpha) return -1
     return 0
killedBy: convexHull should handle collinear points correctly
statusReason: expected [ Array(4) ] to deeply equal [ Array(6) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:10:9
     const alpha = (b.y - a.y) / (b.x - a.x)
     const beta = (c.y - b.y) / (c.x - b.x)
   
-    if (alpha > beta) return 1
+    if (true) return 1
     else if (beta > alpha) return -1
     return 0
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(7) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:11:14
     const beta = (c.y - b.y) / (c.x - b.x)
   
     if (alpha > beta) return 1
-    else if (beta > alpha) return -1
+    else if (beta >= alpha) return -1
     return 0
   }
killedBy: convexHull should handle collinear points correctly
statusReason: expected [ Array(4) ] to deeply equal [ Array(6) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:11:14
     const beta = (c.y - b.y) / (c.x - b.x)
   
     if (alpha > beta) return 1
-    else if (beta > alpha) return -1
+    else if (beta <= alpha) return -1
     return 0
   }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(5) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:17:9
   
   function convexHull(points) {
     const pointsLen = points.length
-    if (pointsLen <= 2) {
+    if (false) {
       throw new Error('Minimum of 3 points is required to form closed polygon!')
     }
killedBy: convexHull should throw an error if less than 3 points are provided
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:17:9
   
   function convexHull(points) {
     const pointsLen = points.length
-    if (pointsLen <= 2) {
+    if (pointsLen < 2) {
       throw new Error('Minimum of 3 points is required to form closed polygon!')
     }
killedBy: convexHull should throw an error if less than 3 points are provided
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/convex-hull-graham-scan.js:21:5
       throw new Error('Minimum of 3 points is required to form closed polygon!')
     }
   
-    points.sort(compare)
+    points
     const p1 = points[0]
     const p2 = points[pointsLen - 1]
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(6) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:23:23
   
     points.sort(compare)
     const p1 = points[0]
-    const p2 = points[pointsLen - 1]
+    const p2 = points[pointsLen + 1]
   
     const upperPoints = []
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] ArrayDeclaration
src/convex-hull-graham-scan.js:26:25
     const p2 = points[pointsLen - 1]
   
     const upperPoints = []
-    const lowerPoints = []
+    const lowerPoints = ["Stryker was here"]
   
     upperPoints.push(p1)
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] UpdateOperator
src/convex-hull-graham-scan.js:31:36
     upperPoints.push(p1)
     lowerPoints.push(p1)
   
-    for (let i = 1; i < pointsLen; i++) {
+    for (let i = 1; i < pointsLen; i--) {
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {
         let upLen = upperPoints.length
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:31:21
     upperPoints.push(p1)
     lowerPoints.push(p1)
   
-    for (let i = 1; i < pointsLen; i++) {
+    for (let i = 1; false; i++) {
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {
         let upLen = upperPoints.length
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: +0 } ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:32:11
     lowerPoints.push(p1)
   
     for (let i = 1; i < pointsLen; i++) {
-      if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {
+      if (false) {
         let upLen = upperPoints.length
   
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(3) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:32:34
     lowerPoints.push(p1)
   
     for (let i = 1; i < pointsLen; i++) {
-      if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {
+      if (i === pointsLen - 1 || false) {
         let upLen = upperPoints.length
   
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(3) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:36:11
         let upLen = upperPoints.length
   
         while (
-          upLen >= 2 &&
-          orientation(
-            upperPoints[upLen - 2],
-            upperPoints[upLen - 1],
-            points[i]
-          ) === -1
+          false
         ) {
           upperPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(7) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:36:11
         let upLen = upperPoints.length
   
         while (
-          upLen >= 2 &&
+          upLen < 2 &&
           orientation(
             upperPoints[upLen - 2],
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:37:11
   
         while (
           upLen >= 2 &&
-          orientation(
-            upperPoints[upLen - 2],
-            upperPoints[upLen - 1],
-            points[i]
-          ) === -1
+          orientation(upperPoints[upLen - 2], upperPoints[upLen - 1], points[i]) !== -1
         ) {
           upperPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(3) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:37:11
   
         while (
           upLen >= 2 &&
-          orientation(
-            upperPoints[upLen - 2],
-            upperPoints[upLen - 1],
-            points[i]
-          ) === -1
+          true
         ) {
           upperPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(3) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:38:25
         while (
           upLen >= 2 &&
           orientation(
-            upperPoints[upLen - 2],
+            upperPoints[upLen + 2],
             upperPoints[upLen - 1],
             points[i]
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:39:25
           upLen >= 2 &&
           orientation(
             upperPoints[upLen - 2],
-            upperPoints[upLen - 1],
+            upperPoints[upLen + 1],
             points[i]
           ) === -1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] UnaryOperator
src/convex-hull-graham-scan.js:41:17
             upperPoints[upLen - 2],
             upperPoints[upLen - 1],
             points[i]
-          ) === -1
+          ) === +1
         ) {
           upperPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(6) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Timeout] BlockStatement
src/convex-hull-graham-scan.js:42:11
             upperPoints[upLen - 1],
             points[i]
           ) === -1
-        ) {
-          upperPoints.pop()
-          upLen = upperPoints.length
-        }
+        ) {}
         upperPoints.push(points[i])
       }

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:48:11
         }
         upperPoints.push(points[i])
       }
-      if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== 1) {
+      if (false) {
         let lowLen = lowerPoints.length
         while (
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, { x: +0, y: +0 } ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:48:34
         }
         upperPoints.push(points[i])
       }
-      if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== 1) {
+      if (i === pointsLen - 1 || false) {
         let lowLen = lowerPoints.length
         while (
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(2) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:51:11
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== 1) {
         let lowLen = lowerPoints.length
         while (
-          lowLen >= 2 &&
+          lowLen > 2 &&
           orientation(
             lowerPoints[lowLen - 2],
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:51:11
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== 1) {
         let lowLen = lowerPoints.length
         while (
-          lowLen >= 2 &&
+          true &&
           orientation(
             lowerPoints[lowLen - 2],
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:52:11
         let lowLen = lowerPoints.length
         while (
           lowLen >= 2 &&
-          orientation(
-            lowerPoints[lowLen - 2],
-            lowerPoints[lowLen - 1],
-            points[i]
-          ) === 1
+          orientation(lowerPoints[lowLen - 2], lowerPoints[lowLen - 1], points[i]) !== 1
         ) {
           lowerPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(2) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:52:11
         let lowLen = lowerPoints.length
         while (
           lowLen >= 2 &&
-          orientation(
-            lowerPoints[lowLen - 2],
-            lowerPoints[lowLen - 1],
-            points[i]
-          ) === 1
+          true
         ) {
           lowerPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(2) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:53:25
         while (
           lowLen >= 2 &&
           orientation(
-            lowerPoints[lowLen - 2],
+            lowerPoints[lowLen + 2],
             lowerPoints[lowLen - 1],
             points[i]
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:54:25
           lowLen >= 2 &&
           orientation(
             lowerPoints[lowLen - 2],
-            lowerPoints[lowLen - 1],
+            lowerPoints[lowLen + 1],
             points[i]
           ) === 1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Timeout] BlockStatement
src/convex-hull-graham-scan.js:57:11
             lowerPoints[lowLen - 1],
             points[i]
           ) === 1
-        ) {
-          lowerPoints.pop()
-          lowLen = lowerPoints.length
-        }
+        ) {}
         lowerPoints.push(points[i])
       }

[Killed] ArrayDeclaration
src/convex-hull-graham-scan.js:64:18
         lowerPoints.push(points[i])
       }
     }
-    const hull = []
+    const hull = ["Stryker was here"]
     for (let i = 1; i < upperPoints.length - 1; i++) {
       hull.push(upperPoints[i])
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ 'Stryker was here', …(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:65:21
       }
     }
     const hull = []
-    for (let i = 1; i < upperPoints.length - 1; i++) {
+    for (let i = 1; false; i++) {
       hull.push(upperPoints[i])
     }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(3) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] BlockStatement
src/convex-hull-graham-scan.js:65:54
       }
     }
     const hull = []
-    for (let i = 1; i < upperPoints.length - 1; i++) {
-      hull.push(upperPoints[i])
-    }
+    for (let i = 1; i < upperPoints.length - 1; i++) {}
     for (let i = lowerPoints.length - 1; i >= 0; i--) {
       hull.push(lowerPoints[i])
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(3) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:68:18
     for (let i = 1; i < upperPoints.length - 1; i++) {
       hull.push(upperPoints[i])
     }
-    for (let i = lowerPoints.length - 1; i >= 0; i--) {
+    for (let i = lowerPoints.length + 1; i >= 0; i--) {
       hull.push(lowerPoints[i])
     }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, undefined, …(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:68:42
     for (let i = 1; i < upperPoints.length - 1; i++) {
       hull.push(upperPoints[i])
     }
-    for (let i = lowerPoints.length - 1; i >= 0; i--) {
+    for (let i = lowerPoints.length - 1; i < 0; i--) {
       hull.push(lowerPoints[i])
     }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 } ] to deeply equal [ { x: +0, y: 3 }, …(3) ]
