[Killed] BlockStatement
src/kmp.js:2:29
 class KMP {
-  computeLPS = (pattern) => {
-    const lps = Array(pattern.length);
-    lps[0] = 0;
-    for (let i = 1; i < pattern.length; i++) {
-      let matched = lps[i - 1];
-      while (matched > 0 && pattern[i] !== pattern[matched]) {
-        matched = lps[matched - 1];
-      }
-      if (pattern[i] === pattern[matched]) {
-        matched++;
-      }
-      lps[i] = matched;
-    }
-    return lps;
-  };
+  computeLPS = (pattern) => {};
 
   KMPSearch = (text, pattern) => {
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected undefined to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] EqualityOperator
src/kmp.js:5:21
   computeLPS = (pattern) => {
     const lps = Array(pattern.length);
     lps[0] = 0;
-    for (let i = 1; i < pattern.length; i++) {
+    for (let i = 1; i >= pattern.length; i++) {
       let matched = lps[i - 1];
       while (matched > 0 && pattern[i] !== pattern[matched]) {
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, undefined, undefined, …(6) ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] BlockStatement
src/kmp.js:5:46
   computeLPS = (pattern) => {
     const lps = Array(pattern.length);
     lps[0] = 0;
-    for (let i = 1; i < pattern.length; i++) {
-      let matched = lps[i - 1];
-      while (matched > 0 && pattern[i] !== pattern[matched]) {
-        matched = lps[matched - 1];
-      }
-      if (pattern[i] === pattern[matched]) {
-        matched++;
-      }
-      lps[i] = matched;
-    }
+    for (let i = 1; i < pattern.length; i++) {}
     return lps;
   };
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, undefined, undefined, …(6) ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] ArithmeticOperator
src/kmp.js:6:25
     const lps = Array(pattern.length);
     lps[0] = 0;
     for (let i = 1; i < pattern.length; i++) {
-      let matched = lps[i - 1];
+      let matched = lps[i + 1];
       while (matched > 0 && pattern[i] !== pattern[matched]) {
         matched = lps[matched - 1];
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, undefined, undefined, …(6) ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] EqualityOperator
src/kmp.js:7:29
     lps[0] = 0;
     for (let i = 1; i < pattern.length; i++) {
       let matched = lps[i - 1];
-      while (matched > 0 && pattern[i] !== pattern[matched]) {
+      while (matched > 0 && pattern[i] === pattern[matched]) {
         matched = lps[matched - 1];
       }
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, +0, 1, +0, +0, 1, +0, 1, +0 ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] ConditionalExpression
src/kmp.js:7:14
     lps[0] = 0;
     for (let i = 1; i < pattern.length; i++) {
       let matched = lps[i - 1];
-      while (matched > 0 && pattern[i] !== pattern[matched]) {
+      while (false) {
         matched = lps[matched - 1];
       }
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, +0, 1, 2, 2, 3, 4, 4, 4 ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Timeout] ArithmeticOperator
src/kmp.js:8:23
     for (let i = 1; i < pattern.length; i++) {
       let matched = lps[i - 1];
       while (matched > 0 && pattern[i] !== pattern[matched]) {
-        matched = lps[matched - 1];
+        matched = lps[matched + 1];
       }
       if (pattern[i] === pattern[matched]) {

[Killed] EqualityOperator
src/kmp.js:10:11
       while (matched > 0 && pattern[i] !== pattern[matched]) {
         matched = lps[matched - 1];
       }
-      if (pattern[i] === pattern[matched]) {
+      if (pattern[i] !== pattern[matched]) {
         matched++;
       }
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, 1, +0, 1, 1, +0, 1, +0, 1 ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] BlockStatement
src/kmp.js:10:44
       while (matched > 0 && pattern[i] !== pattern[matched]) {
         matched = lps[matched - 1];
       }
-      if (pattern[i] === pattern[matched]) {
-        matched++;
-      }
+      if (pattern[i] === pattern[matched]) {}
       lps[i] = matched;
     }
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, +0, +0, +0, +0, +0, +0, +0, +0 ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] UpdateOperator
src/kmp.js:11:9
         matched = lps[matched - 1];
       }
       if (pattern[i] === pattern[matched]) {
-        matched++;
+        matched--;
       }
       lps[i] = matched;
killedBy: KMP Algorithm computeLPS should compute the correct LPS array for a given pattern
statusReason: expected [ +0, +0, -1, -1, -1, -1, -1, -1, -1 ] to deeply equal [ +0, +0, 1, 2, +0, 1, 2, 3, 4 ]

[Killed] ConditionalExpression
src/kmp.js:19:9
   };
 
   KMPSearch = (text, pattern) => {
-    if (!pattern || !text) {
+    if (true) {
       return []; // no results
     }
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] BooleanLiteral
src/kmp.js:19:9
   };
 
   KMPSearch = (text, pattern) => {
-    if (!pattern || !text) {
+    if (pattern || !text) {
       return []; // no results
     }
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] ConditionalExpression
src/kmp.js:29:21
     const result = [];
 
     let matched = 0;
-    for (let i = 0; i < text.length; i++) {
+    for (let i = 0; false; i++) {
       while (matched > 0 && text[i] !== pattern[matched]) {
         matched = lps[matched - 1];
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] BlockStatement
src/kmp.js:29:43
     const result = [];
 
     let matched = 0;
-    for (let i = 0; i < text.length; i++) {
-      while (matched > 0 && text[i] !== pattern[matched]) {
-        matched = lps[matched - 1];
-      }
-      if (text[i] === pattern[matched]) {
-        matched++;
-      }
-      if (matched === pattern.length) {
-        result.push(i - pattern.length + 1);
-        matched = lps[matched - 1];
-      }
-    }
+    for (let i = 0; i < text.length; i++) {}
 
     return result;
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] EqualityOperator
src/kmp.js:30:14
 
     let matched = 0;
     for (let i = 0; i < text.length; i++) {
-      while (matched > 0 && text[i] !== pattern[matched]) {
+      while (matched >= 0 && text[i] !== pattern[matched]) {
         matched = lps[matched - 1];
       }
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] EqualityOperator
src/kmp.js:30:14
 
     let matched = 0;
     for (let i = 0; i < text.length; i++) {
-      while (matched > 0 && text[i] !== pattern[matched]) {
+      while (matched <= 0 && text[i] !== pattern[matched]) {
         matched = lps[matched - 1];
       }
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [ 5, 10 ] to deeply equal [ 10 ]

[Timeout] ArithmeticOperator
src/kmp.js:31:23
     let matched = 0;
     for (let i = 0; i < text.length; i++) {
       while (matched > 0 && text[i] !== pattern[matched]) {
-        matched = lps[matched - 1];
+        matched = lps[matched + 1];
       }
       if (text[i] === pattern[matched]) {

[Killed] BlockStatement
src/kmp.js:33:41
       while (matched > 0 && text[i] !== pattern[matched]) {
         matched = lps[matched - 1];
       }
-      if (text[i] === pattern[matched]) {
-        matched++;
-      }
+      if (text[i] === pattern[matched]) {}
       if (matched === pattern.length) {
         result.push(i - pattern.length + 1);
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] ConditionalExpression
src/kmp.js:33:11
       while (matched > 0 && text[i] !== pattern[matched]) {
         matched = lps[matched - 1];
       }
-      if (text[i] === pattern[matched]) {
+      if (false) {
         matched++;
       }
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] UpdateOperator
src/kmp.js:34:9
         matched = lps[matched - 1];
       }
       if (text[i] === pattern[matched]) {
-        matched++;
+        matched--;
       }
       if (matched === pattern.length) {
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] BlockStatement
src/kmp.js:36:39
       if (text[i] === pattern[matched]) {
         matched++;
       }
-      if (matched === pattern.length) {
-        result.push(i - pattern.length + 1);
-        matched = lps[matched - 1];
-      }
+      if (matched === pattern.length) {}
     }
 
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] ConditionalExpression
src/kmp.js:36:11
       if (text[i] === pattern[matched]) {
         matched++;
       }
-      if (matched === pattern.length) {
+      if (false) {
         result.push(i - pattern.length + 1);
         matched = lps[matched - 1];
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [] to deeply equal [ 10 ]

[Killed] ArithmeticOperator
src/kmp.js:37:21
         matched++;
       }
       if (matched === pattern.length) {
-        result.push(i - pattern.length + 1);
+        result.push(i + pattern.length + 1);
         matched = lps[matched - 1];
       }
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [ 28 ] to deeply equal [ 10 ]

[Killed] ArithmeticOperator
src/kmp.js:37:21
         matched++;
       }
       if (matched === pattern.length) {
-        result.push(i - pattern.length + 1);
+        result.push(i - pattern.length - 1);
         matched = lps[matched - 1];
       }
killedBy: KMP Algorithm KMPSearch should return the correct starting indices of the pattern in the text
statusReason: expected [ 8 ] to deeply equal [ 10 ]

[Survived] ArithmeticOperator
src/kmp.js:38:23
       }
       if (matched === pattern.length) {
         result.push(i - pattern.length + 1);
-        matched = lps[matched - 1];
+        matched = lps[matched + 1];
       }
     }
