[Killed] BlockStatement
src/number-of-islands.js:6:33
     const matrix = matrixGrid;
     let counter = 0;
 
-    const flood = (row, col) => {
-      if (row < 0 || col < 0) return; 
-      if (row >= matrix.length || col >= matrix[row].length) return; 
-
-      const tile = matrix[row][col];
-      if (tile !== "1") return;
-
-      matrix[row][col] = "0";
-
-      flood(row + 1, col);
-      flood(row - 1, col);
-      flood(row, col + 1);
-      flood(row, col - 1);
-    };
+    const flood = (row, col) => {};
 
     for (let row = 0; row < matrix.length; row += 1) {
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 3 to equal 1

[Killed] EqualityOperator
src/number-of-islands.js:7:11
     let counter = 0;
 
     const flood = (row, col) => {
-      if (row < 0 || col < 0) return; 
+      if (row <= 0 || col < 0) return; 
       if (row >= matrix.length || col >= matrix[row].length) return; 
 
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 3 to equal 1

[Killed] LogicalOperator
src/number-of-islands.js:7:11
     let counter = 0;
 
     const flood = (row, col) => {
-      if (row < 0 || col < 0) return; 
+      if (row < 0 && col < 0) return; 
       if (row >= matrix.length || col >= matrix[row].length) return; 
 
killedBy: Islands should return 1 for a grid with one island
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/number-of-islands.js:8:35
 
     const flood = (row, col) => {
       if (row < 0 || col < 0) return; 
-      if (row >= matrix.length || col >= matrix[row].length) return; 
+      if (row >= matrix.length || col < matrix[row].length) return; 
 
       const tile = matrix[row][col];
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 3 to equal 1

[Killed] ConditionalExpression
src/number-of-islands.js:8:11
 
     const flood = (row, col) => {
       if (row < 0 || col < 0) return; 
-      if (row >= matrix.length || col >= matrix[row].length) return; 
+      if (true) return; 
 
       const tile = matrix[row][col];
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 3 to equal 1

[Killed] ArithmeticOperator
src/number-of-islands.js:15:13
 
       matrix[row][col] = "0";
 
-      flood(row + 1, col);
+      flood(row - 1, col);
       flood(row - 1, col);
       flood(row, col + 1);
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 2 to equal 1

[Survived] ArithmeticOperator
src/number-of-islands.js:16:13
       matrix[row][col] = "0";
 
       flood(row + 1, col);
-      flood(row - 1, col);
+      flood(row + 1, col);
       flood(row, col + 1);
       flood(row, col - 1);

[Killed] ArithmeticOperator
src/number-of-islands.js:17:18
 
       flood(row + 1, col);
       flood(row - 1, col);
-      flood(row, col + 1);
+      flood(row, col - 1);
       flood(row, col - 1);
     };
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 2 to equal 1

[Survived] ArithmeticOperator
src/number-of-islands.js:18:18
       flood(row + 1, col);
       flood(row - 1, col);
       flood(row, col + 1);
-      flood(row, col - 1);
+      flood(row, col + 1);
     };
 

[Killed] ConditionalExpression
src/number-of-islands.js:21:23
       flood(row, col - 1);
     };
 
-    for (let row = 0; row < matrix.length; row += 1) {
+    for (let row = 0; false; row += 1) {
       for (let col = 0; col < matrix[row].length; col += 1) {
         const current = matrix[row][col];
killedBy: Islands should return 1 for a grid with one island
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/number-of-islands.js:22:25
     };
 
     for (let row = 0; row < matrix.length; row += 1) {
-      for (let col = 0; col < matrix[row].length; col += 1) {
+      for (let col = 0; false; col += 1) {
         const current = matrix[row][col];
         if (current === "1") {
killedBy: Islands should return 1 for a grid with one island
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/number-of-islands.js:24:13
     for (let row = 0; row < matrix.length; row += 1) {
       for (let col = 0; col < matrix[row].length; col += 1) {
         const current = matrix[row][col];
-        if (current === "1") {
+        if (true) {
           flood(row, col);
           counter += 1;
killedBy: Islands should return 0 for a grid with no islands
statusReason: expected 9 to equal +0

[Killed] ConditionalExpression
src/number-of-islands.js:24:13
     for (let row = 0; row < matrix.length; row += 1) {
       for (let col = 0; col < matrix[row].length; col += 1) {
         const current = matrix[row][col];
-        if (current === "1") {
+        if (false) {
           flood(row, col);
           counter += 1;
killedBy: Islands should return 1 for a grid with one island
statusReason: expected +0 to equal 1
