[Killed] BlockStatement
src/temperature-conversion.js:2:38
 class TemperatureConversion {
-  celsiusToFahrenheit = (celsius) => {
-    return Math.round((celsius * 9) / 5 + 32);
-  };
+  celsiusToFahrenheit = (celsius) => {};
 
   celsiusToKelvin = (celsius) => {
killedBy: TemperatureConversion should convert Celsius to Fahrenheit correctly
statusReason: expected undefined to equal 32

[Killed] ArithmeticOperator
src/temperature-conversion.js:3:23
 class TemperatureConversion {
   celsiusToFahrenheit = (celsius) => {
-    return Math.round((celsius * 9) / 5 + 32);
+    return Math.round(celsius * 9 * 5 + 32);
   };
 
killedBy: TemperatureConversion should convert Celsius to Fahrenheit correctly
statusReason: expected 4532 to equal 212

[Killed] ArithmeticOperator
src/temperature-conversion.js:3:24
 class TemperatureConversion {
   celsiusToFahrenheit = (celsius) => {
-    return Math.round((celsius * 9) / 5 + 32);
+    return Math.round((celsius / 9) / 5 + 32);
   };
 
killedBy: TemperatureConversion should convert Celsius to Fahrenheit correctly
statusReason: expected 34 to equal 212

[Killed] BlockStatement
src/temperature-conversion.js:6:34
     return Math.round((celsius * 9) / 5 + 32);
   };
 
-  celsiusToKelvin = (celsius) => {
-    return Math.round(celsius + 273.15);
-  };
+  celsiusToKelvin = (celsius) => {};
 
   celsiusToRankine = (celsius) => {
killedBy: TemperatureConversion should convert Celsius to Kelvin correctly
statusReason: expected undefined to equal 273

[Killed] ArithmeticOperator
src/temperature-conversion.js:7:23
   };
 
   celsiusToKelvin = (celsius) => {
-    return Math.round(celsius + 273.15);
+    return Math.round(celsius - 273.15);
   };
 
killedBy: TemperatureConversion should convert Celsius to Kelvin correctly
statusReason: expected -273 to equal 273

[Killed] BlockStatement
src/temperature-conversion.js:10:35
     return Math.round(celsius + 273.15);
   };
 
-  celsiusToRankine = (celsius) => {
-    return Math.round((celsius * 9) / 5 + 491.67);
-  };
+  celsiusToRankine = (celsius) => {};
 
   fahrenheitToCelsius = (fahrenheit) => {
killedBy: TemperatureConversion should convert Celsius to Rankine correctly
statusReason: expected undefined to equal 492

[Killed] ArithmeticOperator
src/temperature-conversion.js:11:24
   };
 
   celsiusToRankine = (celsius) => {
-    return Math.round((celsius * 9) / 5 + 491.67);
+    return Math.round((celsius / 9) / 5 + 491.67);
   };
 
killedBy: TemperatureConversion should convert Celsius to Rankine correctly
statusReason: expected 494 to equal 672

[Killed] ArithmeticOperator
src/temperature-conversion.js:11:23
   };
 
   celsiusToRankine = (celsius) => {
-    return Math.round((celsius * 9) / 5 + 491.67);
+    return Math.round(celsius * 9 * 5 + 491.67);
   };
 
killedBy: TemperatureConversion should convert Celsius to Rankine correctly
statusReason: expected 4992 to equal 672

[Killed] BlockStatement
src/temperature-conversion.js:14:41
     return Math.round((celsius * 9) / 5 + 491.67);
   };
 
-  fahrenheitToCelsius = (fahrenheit) => {
-    return Math.round(((fahrenheit - 32) * 5) / 9);
-  };
+  fahrenheitToCelsius = (fahrenheit) => {};
 
   fahrenheitToKelvin = (fahrenheit) => {
killedBy: TemperatureConversion should convert Fahrenheit to Celsius correctly
statusReason: expected undefined to equal +0

[Killed] ArithmeticOperator
src/temperature-conversion.js:15:25
   };
 
   fahrenheitToCelsius = (fahrenheit) => {
-    return Math.round(((fahrenheit - 32) * 5) / 9);
+    return Math.round(((fahrenheit + 32) * 5) / 9);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Celsius correctly
statusReason: expected 36 to equal +0

[Killed] ArithmeticOperator
src/temperature-conversion.js:15:24
   };
 
   fahrenheitToCelsius = (fahrenheit) => {
-    return Math.round(((fahrenheit - 32) * 5) / 9);
+    return Math.round(((fahrenheit - 32) / 5) / 9);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Celsius correctly
statusReason: expected 4 to equal 100

[Killed] BlockStatement
src/temperature-conversion.js:18:40
     return Math.round(((fahrenheit - 32) * 5) / 9);
   };
 
-  fahrenheitToKelvin = (fahrenheit) => {
-    return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
-  };
+  fahrenheitToKelvin = (fahrenheit) => {};
 
   kelvinToCelsius = (kelvin) => {
killedBy: TemperatureConversion should convert Fahrenheit to Kelvin correctly
statusReason: expected undefined to equal 273

[Killed] ArithmeticOperator
src/temperature-conversion.js:19:23
   };
 
   fahrenheitToKelvin = (fahrenheit) => {
-    return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
+    return Math.round((fahrenheit - 32) * 5 / 9 - 273.15);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Kelvin correctly
statusReason: expected -273 to equal 273

[Killed] ArithmeticOperator
src/temperature-conversion.js:19:24
   };
 
   fahrenheitToKelvin = (fahrenheit) => {
-    return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
+    return Math.round(((fahrenheit - 32) / 5) / 9 + 273.15);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Kelvin correctly
statusReason: expected 277 to equal 373

[Killed] BlockStatement
src/temperature-conversion.js:22:33
     return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
   };
 
-  kelvinToCelsius = (kelvin) => {
-    return Math.round(kelvin - 273.15);
-  };
+  kelvinToCelsius = (kelvin) => {};
 
   kelvinToFahrenheit = (kelvin) => {
killedBy: TemperatureConversion should convert Kelvin to Celsius correctly
statusReason: expected undefined to equal +0

[Killed] ArithmeticOperator
src/temperature-conversion.js:23:23
   };
 
   kelvinToCelsius = (kelvin) => {
-    return Math.round(kelvin - 273.15);
+    return Math.round(kelvin + 273.15);
   };
 
killedBy: TemperatureConversion should convert Kelvin to Celsius correctly
statusReason: expected 546 to equal +0

[Killed] BlockStatement
src/temperature-conversion.js:26:36
     return Math.round(kelvin - 273.15);
   };
 
-  kelvinToFahrenheit = (kelvin) => {
-    return Math.round(((kelvin - 273.15) * 9) / 5 + 32);
-  };
+  kelvinToFahrenheit = (kelvin) => {};
 }
 
killedBy: TemperatureConversion should convert Kelvin to Fahrenheit correctly
statusReason: expected undefined to equal 32

[Killed] ArithmeticOperator
src/temperature-conversion.js:27:24
   };
 
   kelvinToFahrenheit = (kelvin) => {
-    return Math.round(((kelvin - 273.15) * 9) / 5 + 32);
+    return Math.round(((kelvin - 273.15) / 9) / 5 + 32);
   };
 }
killedBy: TemperatureConversion should convert Kelvin to Fahrenheit correctly
statusReason: expected 34 to equal 212

[Killed] ArithmeticOperator
src/temperature-conversion.js:27:25
   };
 
   kelvinToFahrenheit = (kelvin) => {
-    return Math.round(((kelvin - 273.15) * 9) / 5 + 32);
+    return Math.round(((kelvin + 273.15) * 9) / 5 + 32);
   };
 }
killedBy: TemperatureConversion should convert Kelvin to Fahrenheit correctly
statusReason: expected 1015 to equal 32
