[Survived] StringLiteral
src/find-month-calendar.js:9:48
 
 class Month {
     constructor() {
-        this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
+        this.Days = ['M', 'T', 'W', 'Th', 'F', "", 'Su']
         this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
         this.epoch = { month: 1, year: 1900 }

[Survived] StringLiteral
src/find-month-calendar.js:9:32
 
 class Month {
     constructor() {
-        this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
+        this.Days = ['M', 'T', "", 'Th', 'F', 'S', 'Su']
         this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
         this.epoch = { month: 1, year: 1900 }

[Survived] StringLiteral
src/find-month-calendar.js:10:50
 class Month {
     constructor() {
         this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
-        this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
+        this.BDays = ['M', 'Su', 'S', 'F', 'Th', "", 'T']
         this.epoch = { month: 1, year: 1900 }
         this.monthDays = [31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

[Survived] StringLiteral
src/find-month-calendar.js:10:28
 class Month {
     constructor() {
         this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
-        this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
+        this.BDays = ['M', "", 'S', 'F', 'Th', 'W', 'T']
         this.epoch = { month: 1, year: 1900 }
         this.monthDays = [31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

[Survived] ArrayDeclaration
src/find-month-calendar.js:12:26
         this.Days = ['M', 'T', 'W', 'Th', 'F', 'S', 'Su']
         this.BDays = ['M', 'Su', 'S', 'F', 'Th', 'W', 'T']
         this.epoch = { month: 1, year: 1900 }
-        this.monthDays = [31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
+        this.monthDays = []
         this.monthDaysLeap = [31, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
     }

[Killed] ConditionalExpression
src/find-month-calendar.js:17:37
     }
     
     isLeapYear = (year) => {
-        return year % 400 === 0 || (year % 100 !== 0 && year % 4 === 0)
+        return year % 400 === 0 || (true && year % 4 === 0)
     }
 
killedBy: Month Calendar Tests should identify leap years correctly
statusReason: expected true to be false

[NoCoverage] StringLiteral
src/find-month-calendar.js:21:16
     }
 
     printCal(days, startDay, output = (value) => console.log(value)) {
-        output('M   T   W   Th  F   S   Su')
+        output("")
         const dates = []
         let i

[NoCoverage] ArrayDeclaration
src/find-month-calendar.js:22:23
 
     printCal(days, startDay, output = (value) => console.log(value)) {
         output('M   T   W   Th  F   S   Su')
-        const dates = []
+        const dates = ["Stryker was here"]
         let i
         for (i = 1; i <= days; i++) {

[NoCoverage] EqualityOperator
src/find-month-calendar.js:24:21
         output('M   T   W   Th  F   S   Su')
         const dates = []
         let i
-        for (i = 1; i <= days; i++) {
+        for (i = 1; i > days; i++) {
             dates.push(i)
         }

[NoCoverage] UpdateOperator
src/find-month-calendar.js:27:54
         for (i = 1; i <= days; i++) {
             dates.push(i)
         }
-        for (i = 0; i < this.Days.indexOf(startDay); i++) {
+        for (i = 0; i < this.Days.indexOf(startDay); i--) {
             dates.unshift(' ')
         }

[NoCoverage] EqualityOperator
src/find-month-calendar.js:32:34
         }
         while (true) {
             let row = ''
-            for (i = 0; i < 7 && dates.length !== 0; i++) {
+            for (i = 0; i < 7 && dates.length === 0; i++) {
                 row += dates.shift()
                 while (row.length % 4 !== 0) {

[NoCoverage] BlockStatement
src/find-month-calendar.js:32:59
         }
         while (true) {
             let row = ''
-            for (i = 0; i < 7 && dates.length !== 0; i++) {
-                row += dates.shift()
-                while (row.length % 4 !== 0) {
-                    row += ' '
-                }
-            }
+            for (i = 0; i < 7 && dates.length !== 0; i++) {}
             output(row)
             if (dates.length === 0) break

[NoCoverage] EqualityOperator
src/find-month-calendar.js:39:17
                 }
             }
             output(row)
-            if (dates.length === 0) break
+            if (dates.length !== 0) break
         }
     }

[Killed] EqualityOperator
src/find-month-calendar.js:47:21
         const dateAr = []
         let block = ''
         let i
-        for (i = 0; i < date.length; i++) {
+        for (i = 0; i >= date.length; i++) {
             if (date[i] === '/') {
                 dateAr.push(parseInt(block))
killedBy: Month Calendar Tests should parse date correctly
statusReason: Improper string encoding

[Killed] ConditionalExpression
src/find-month-calendar.js:48:17
         let block = ''
         let i
         for (i = 0; i < date.length; i++) {
-            if (date[i] === '/') {
+            if (true) {
                 dateAr.push(parseInt(block))
                 block = ''
killedBy: Month Calendar Tests should parse date correctly
statusReason: Improper string encoding

[Killed] StringLiteral
src/find-month-calendar.js:50:25
         for (i = 0; i < date.length; i++) {
             if (date[i] === '/') {
                 dateAr.push(parseInt(block))
-                block = ''
+                block = "Stryker was here!"
                 continue
             }
killedBy: Month Calendar Tests should parse date correctly
statusReason: expected { month: 12, year: NaN } to deeply equal { month: 12, year: 2021 }

[Killed] ObjectLiteral
src/find-month-calendar.js:57:24
         }
         dateAr.push(parseInt(block))
         if (dateAr.length !== 2) throw new Error('Improper string encoding')
-        const dateOb = { month: dateAr[0], year: dateAr[1] }
+        const dateOb = {}
         return dateOb
     }
killedBy: Month Calendar Tests should parse date correctly
statusReason: expected {} to deeply equal { month: 12, year: 2021 }

[Killed] BlockStatement
src/find-month-calendar.js:68:53
             return false
         } else if (startDate.month > endDate.month) {
             return true
-        } else if (startDate.month < endDate.month) {
-            return false
-        }
+        } else if (startDate.month < endDate.month) {}
         return true
     }
killedBy: Month Calendar Tests should correctly identify if start date is not greater than end date
statusReason: expected true to be false

[Survived] ConditionalExpression
src/find-month-calendar.js:77:20
     getDayDiff(startDate, endDate) {
         if (this.isGreater(startDate, endDate) === null) {
             return 0
-        } else if (this.isGreater(startDate, endDate) === true) {
+        } else if (false) {
             const midDate = startDate
             startDate = endDate
