[Killed] BlockStatement
src/searching.js:3:58
 class Searching {
     // https://the-algorithms.com/algorithm/binary-search?lang=javascript
-    binarySearch(arr, x, low = 0, high = arr.length - 1) {
-        while (high >= low) {
-            const mid = Math.floor(low + (high - low) / 2)
-
-            if (arr[mid] === x) {
-                // item found => return its index
-                return mid
-            }
-
-            if (x < arr[mid]) {
-                // arr[mid] is an upper bound for x, so if x is in arr => low <= x < mid
-                high = mid - 1
-            } else {
-                // arr[mid] is a lower bound for x, so if x is in arr => mid < x <= high
-                low = mid + 1
-            }
-        }
-        // if low > high => we have searched the whole array without finding the item
-        return -1
-    }
+    binarySearch(arr, x, low = 0, high = arr.length - 1) {}
 
     // https://the-algorithms.com/algorithm/linear-search?lang=javascript
killedBy: Searching should find the index of the element using binary search
statusReason: expected undefined to equal 2

[Killed] ArithmeticOperator
src/searching.js:3:42
 class Searching {
     // https://the-algorithms.com/algorithm/binary-search?lang=javascript
-    binarySearch(arr, x, low = 0, high = arr.length - 1) {
+    binarySearch(arr, x, low = 0, high = arr.length + 1) {
         while (high >= low) {
             const mid = Math.floor(low + (high - low) / 2)
killedBy: Searching should find the index of the element using binary search
statusReason: expected 3 to equal 2

[Killed] ConditionalExpression
src/searching.js:4:16
 class Searching {
     // https://the-algorithms.com/algorithm/binary-search?lang=javascript
     binarySearch(arr, x, low = 0, high = arr.length - 1) {
-        while (high >= low) {
+        while (false) {
             const mid = Math.floor(low + (high - low) / 2)
 
killedBy: Searching should find the index of the element using binary search
statusReason: expected -1 to equal 2

[Killed] BlockStatement
src/searching.js:7:33
         while (high >= low) {
             const mid = Math.floor(low + (high - low) / 2)
 
-            if (arr[mid] === x) {
-                // item found => return its index
-                return mid
-            }
+            if (arr[mid] === x) {}
 
             if (x < arr[mid]) {
killedBy: Searching should find the index of the element using binary search
statusReason: expected -1 to equal 2

[Timeout] ArithmeticOperator
src/searching.js:14:24
 
             if (x < arr[mid]) {
                 // arr[mid] is an upper bound for x, so if x is in arr => low <= x < mid
-                high = mid - 1
+                high = mid + 1
             } else {
                 // arr[mid] is a lower bound for x, so if x is in arr => mid < x <= high

[Timeout] BlockStatement
src/searching.js:15:20
             if (x < arr[mid]) {
                 // arr[mid] is an upper bound for x, so if x is in arr => low <= x < mid
                 high = mid - 1
-            } else {
-                // arr[mid] is a lower bound for x, so if x is in arr => mid < x <= high
-                low = mid + 1
-            }
+            } else {}
         }
         // if low > high => we have searched the whole array without finding the item

[Timeout] ArithmeticOperator
src/searching.js:17:23
                 high = mid - 1
             } else {
                 // arr[mid] is a lower bound for x, so if x is in arr => mid < x <= high
-                low = mid + 1
+                low = mid - 1
             }
         }

[Killed] UnaryOperator
src/searching.js:21:16
             }
         }
         // if low > high => we have searched the whole array without finding the item
-        return -1
+        return +1
     }
 
killedBy: Searching should return -1 if the element is not found
statusReason: expected 1 to equal -1

[NoCoverage] BlockStatement
src/searching.js:25:33
     }
 
     // https://the-algorithms.com/algorithm/linear-search?lang=javascript
-    linearSearch(theArray, key) {
-        for (let n = 0; n < theArray.length; n++) {
-          if (theArray[n] === key) {
-            return n
-          }
-        }
-        return -1
-      }
+    linearSearch(theArray, key) {}
 }
 

[NoCoverage] BlockStatement
src/searching.js:26:51
 
     // https://the-algorithms.com/algorithm/linear-search?lang=javascript
     linearSearch(theArray, key) {
-        for (let n = 0; n < theArray.length; n++) {
-          if (theArray[n] === key) {
-            return n
-          }
-        }
+        for (let n = 0; n < theArray.length; n++) {}
         return -1
       }

[NoCoverage] ConditionalExpression
src/searching.js:26:25
 
     // https://the-algorithms.com/algorithm/linear-search?lang=javascript
     linearSearch(theArray, key) {
-        for (let n = 0; n < theArray.length; n++) {
+        for (let n = 0; false; n++) {
           if (theArray[n] === key) {
             return n

[NoCoverage] ConditionalExpression
src/searching.js:27:15
     // https://the-algorithms.com/algorithm/linear-search?lang=javascript
     linearSearch(theArray, key) {
         for (let n = 0; n < theArray.length; n++) {
-          if (theArray[n] === key) {
+          if (false) {
             return n
           }
