[Killed] BooleanLiteral
src/simpson-integration.js:3:19
 function integralEvaluation(N, a, b, func) {
     // Check if N is an even integer
-    let isNEven = true
+    let isNEven = false
     if (N % 2 !== 0) isNEven = false
 
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got 'N is not an even number'

[Killed] ConditionalExpression
src/simpson-integration.js:4:9
 function integralEvaluation(N, a, b, func) {
     // Check if N is an even integer
     let isNEven = true
-    if (N % 2 !== 0) isNEven = false
+    if (true) isNEven = false
 
     if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got 'N is not an even number'

[Killed] BooleanLiteral
src/simpson-integration.js:6:9
     let isNEven = true
     if (N % 2 !== 0) isNEven = false
 
-    if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
+    if (Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
         throw new TypeError('Expected integer N and finite a, b')
     }
killedBy: integralEvaluation should throw TypeError if N is not an integer
statusReason: expected [Function] to throw 'TypeError' but 'Error: N is not an even number' was thrown

[Killed] BooleanLiteral
src/simpson-integration.js:9:9
     if (!Number.isInteger(N) || Number.isNaN(a) || Number.isNaN(b)) {
         throw new TypeError('Expected integer N and finite a, b')
     }
-    if (!isNEven) {
+    if (isNEven) {
         throw Error('N is not an even number')
     }
killedBy: integralEvaluation should throw Error if N is not even
statusReason: expected [Function] to throw Error

[Killed] EqualityOperator
src/simpson-integration.js:12:9
     if (!isNEven) {
         throw Error('N is not an even number')
     }
-    if (N <= 0) {
+    if (N > 0) {
         throw Error('N has to be >= 2')
     }
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got 'Result is NaN. The input interval doe…'

[Killed] EqualityOperator
src/simpson-integration.js:12:9
     if (!isNEven) {
         throw Error('N is not an even number')
     }
-    if (N <= 0) {
+    if (N < 0) {
         throw Error('N has to be >= 2')
     }
killedBy: integralEvaluation should throw Error if N is less than or equal to 0
statusReason: expected [Function] to throw error including 'N has to be >= 2' but got 'Result is NaN. The input interval doe…'

[Killed] ConditionalExpression
src/simpson-integration.js:17:9
     }
 
     // Check if a < b
-    if (a > b) {
+    if (true) {
         throw Error('a must be less or equal than b')
     }
killedBy: integralEvaluation should return 0 if a is equal to b
statusReason: a must be less or equal than b

[Killed] ConditionalExpression
src/simpson-integration.js:17:9
     }
 
     // Check if a < b
-    if (a > b) {
+    if (false) {
         throw Error('a must be less or equal than b')
     }
killedBy: integralEvaluation should throw Error if a is greater than b
statusReason: expected [Function] to throw Error

[Killed] ArithmeticOperator
src/simpson-integration.js:23:15
     if (a === b) return 0
 
     // Calculate the step h
-    const h = (b - a) / N
+    const h = (b - a) * N
 
     // Find interpolation points
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 2.688110056919238e-7 to be close to 2 +/- 0.01

[Survived] ArithmeticOperator
src/simpson-integration.js:23:16
     if (a === b) return 0
 
     // Calculate the step h
-    const h = (b - a) / N
+    const h = (b + a) / N
 
     // Find interpolation points

[Killed] EqualityOperator
src/simpson-integration.js:32:13
     // Find the sum {f(x0) + 4*f(x1) + 2*f(x2) + ... + 2*f(xN-2) + 4*f(xN-1) + f(xN)}
     let temp
     for (let i = 0; i < N + 1; i++) {
-        if (i === 0 || i === N) temp = func(xi)
+        if (i !== 0 || i === N) temp = func(xi)
         else if (i % 2 === 0) temp = 2 * func(xi)
         else temp = 4 * func(xi)
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 0.6666118346291484 to be close to 2 +/- 0.01

[Killed] ArithmeticOperator
src/simpson-integration.js:41:18
     }
 
     // Calculate the integral
-    let result = h / 3
+    let result = h * 3
     temp = pointsArray.reduce((acc, currValue) => acc + currValue, 0)
 
killedBy: integralEvaluation should correctly evaluate the integral of sin(x) from 0 to pi
statusReason: expected 18.000000097420553 to be close to 2 +/- 0.01

[Survived] ConditionalExpression
src/simpson-integration.js:46:9
 
     result *= temp
 
-    if (Number.isNaN(result)) {
+    if (false) {
         throw Error(
             "Result is NaN. The input interval doesn't belong to the functions domain"
