[Killed] BlockStatement
src/sorting.js:3:23
 class Sorting {
     // https://the-algorithms.com/algorithm/bubble-sort?lang=javascript
-    bubbleSort(items) {
-        const length = items.length
-        let noSwaps
-
-        for (let i = length; i > 0; i--) {
-            // flag for optimization
-            noSwaps = true
-            // Number of passes
-            for (let j = 0; j < i - 1; j++) {
-                // Compare the adjacent positions
-                if (items[j] > items[j + 1]) {
-                    // Swap the numbers
-                    ;[items[j], items[j + 1]] = [items[j + 1], items[j]]
-                    noSwaps = false
-                }
-            }
-            if (noSwaps) {
-                break
-            }
-        }
-
-        return items
-    }
+    bubbleSort(items) {}
 
     // https://the-algorithms.com/algorithm/find-second-largest-element?lang=javascript
killedBy: Sorting should sort the array using bubble sort
statusReason: expected undefined to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] BlockStatement
src/sorting.js:7:42
         const length = items.length
         let noSwaps
 
-        for (let i = length; i > 0; i--) {
-            // flag for optimization
-            noSwaps = true
-            // Number of passes
-            for (let j = 0; j < i - 1; j++) {
-                // Compare the adjacent positions
-                if (items[j] > items[j + 1]) {
-                    // Swap the numbers
-                    ;[items[j], items[j + 1]] = [items[j + 1], items[j]]
-                    noSwaps = false
-                }
-            }
-            if (noSwaps) {
-                break
-            }
-        }
+        for (let i = length; i > 0; i--) {}
 
         return items
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Survived] BooleanLiteral
src/sorting.js:9:23
 
         for (let i = length; i > 0; i--) {
             // flag for optimization
-            noSwaps = true
+            noSwaps = false
             // Number of passes
             for (let j = 0; j < i - 1; j++) {

[Killed] EqualityOperator
src/sorting.js:11:29
             // flag for optimization
             noSwaps = true
             // Number of passes
-            for (let j = 0; j < i - 1; j++) {
+            for (let j = 0; j >= i - 1; j++) {
                 // Compare the adjacent positions
                 if (items[j] > items[j + 1]) {
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ConditionalExpression
src/sorting.js:13:21
             // Number of passes
             for (let j = 0; j < i - 1; j++) {
                 // Compare the adjacent positions
-                if (items[j] > items[j + 1]) {
+                if (false) {
                     // Swap the numbers
                     ;[items[j], items[j + 1]] = [items[j + 1], items[j]]
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] EqualityOperator
src/sorting.js:13:21
             // Number of passes
             for (let j = 0; j < i - 1; j++) {
                 // Compare the adjacent positions
-                if (items[j] > items[j + 1]) {
+                if (items[j] <= items[j + 1]) {
                     // Swap the numbers
                     ;[items[j], items[j + 1]] = [items[j + 1], items[j]]
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 9, 6, 5, 5, 2, 1 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/sorting.js:15:56
                 // Compare the adjacent positions
                 if (items[j] > items[j + 1]) {
                     // Swap the numbers
-                    ;[items[j], items[j + 1]] = [items[j + 1], items[j]]
+                    ;[items[j], items[j + 1]] = [items[j - 1], items[j]]
                     noSwaps = false
                 }
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ undefined, 5, 5, 5, 5, 9 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/sorting.js:15:39
                 // Compare the adjacent positions
                 if (items[j] > items[j + 1]) {
                     // Swap the numbers
-                    ;[items[j], items[j + 1]] = [items[j + 1], items[j]]
+                    ;[items[j], items[j - 1]] = [items[j + 1], items[j]]
                     noSwaps = false
                 }
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 1, 1, 1, 1, 5, 6, …(1) ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] BooleanLiteral
src/sorting.js:16:31
                 if (items[j] > items[j + 1]) {
                     // Swap the numbers
                     ;[items[j], items[j + 1]] = [items[j + 1], items[j]]
-                    noSwaps = false
+                    noSwaps = true
                 }
             }
killedBy: Sorting should sort the array using bubble sort
statusReason: expected [ 2, 5, 1, 5, 6, 9 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Survived] BlockStatement
src/sorting.js:19:26
                     noSwaps = false
                 }
             }
-            if (noSwaps) {
-                break
-            }
+            if (noSwaps) {}
         }
 

[NoCoverage] BlockStatement
src/sorting.js:28:39
     }
 
     // https://the-algorithms.com/algorithm/find-second-largest-element?lang=javascript
-    secondLargestElement = (array) => {
-        const largestElement = Math.max(...array)
-        let element = -Number.MAX_VALUE
-      
-        for (let i = 0; i < array.length; i++) {
-          if (element < array[i] && array[i] !== largestElement) {
-            element = array[i]
-          }
-        }
-      
-        return element
-      }
+    secondLargestElement = (array) => {}
     
 }

[NoCoverage] EqualityOperator
src/sorting.js:32:25
         const largestElement = Math.max(...array)
         let element = -Number.MAX_VALUE
       
-        for (let i = 0; i < array.length; i++) {
+        for (let i = 0; i <= array.length; i++) {
           if (element < array[i] && array[i] !== largestElement) {
             element = array[i]

[NoCoverage] BlockStatement
src/sorting.js:32:48
         const largestElement = Math.max(...array)
         let element = -Number.MAX_VALUE
       
-        for (let i = 0; i < array.length; i++) {
-          if (element < array[i] && array[i] !== largestElement) {
-            element = array[i]
-          }
-        }
+        for (let i = 0; i < array.length; i++) {}
       
         return element

[NoCoverage] EqualityOperator
src/sorting.js:33:15
         let element = -Number.MAX_VALUE
       
         for (let i = 0; i < array.length; i++) {
-          if (element < array[i] && array[i] !== largestElement) {
+          if (element >= array[i] && array[i] !== largestElement) {
             element = array[i]
           }
