[Killed] BlockStatement
src/validate-credit-card.js:1:46
-const luhnValidation = (creditCardNumber) => {
-    let validationSum = 0
-    creditCardNumber.split('').forEach((digit, index) => {
-        let currentDigit = parseInt(digit)
-        if (index % 2 === 0) {
-            // Multiply every 2nd digit from the left by 2
-            currentDigit *= 2
-            // if product is greater than 10 add the individual digits of the product to get a single digit
-            if (currentDigit > 9) {
-                currentDigit %= 10
-                currentDigit += 1
-            }
-        }
-        validationSum += currentDigit
-    })
-
-    return validationSum % 10 === 0
-}
+const luhnValidation = (creditCardNumber) => {}
 
 const validateCreditCard = (creditCardString) => {
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] BlockStatement
src/validate-credit-card.js:3:58
 const luhnValidation = (creditCardNumber) => {
     let validationSum = 0
-    creditCardNumber.split('').forEach((digit, index) => {
-        let currentDigit = parseInt(digit)
-        if (index % 2 === 0) {
-            // Multiply every 2nd digit from the left by 2
-            currentDigit *= 2
-            // if product is greater than 10 add the individual digits of the product to get a single digit
-            if (currentDigit > 9) {
-                currentDigit %= 10
-                currentDigit += 1
-            }
-        }
-        validationSum += currentDigit
-    })
+    creditCardNumber.split('').forEach((digit, index) => {})
 
     return validationSum % 10 === 0
killedBy: validateCreditCard should throw an error for a card number that fails the Luhn check
statusReason: expected [Function] to throw Error

[Killed] AssignmentOperator
src/validate-credit-card.js:7:13
         let currentDigit = parseInt(digit)
         if (index % 2 === 0) {
             // Multiply every 2nd digit from the left by 2
-            currentDigit *= 2
+            currentDigit /= 2
             // if product is greater than 10 add the individual digits of the product to get a single digit
             if (currentDigit > 9) {
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] ConditionalExpression
src/validate-credit-card.js:9:17
             // Multiply every 2nd digit from the left by 2
             currentDigit *= 2
             // if product is greater than 10 add the individual digits of the product to get a single digit
-            if (currentDigit > 9) {
+            if (true) {
                 currentDigit %= 10
                 currentDigit += 1
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] EqualityOperator
src/validate-credit-card.js:9:17
             // Multiply every 2nd digit from the left by 2
             currentDigit *= 2
             // if product is greater than 10 add the individual digits of the product to get a single digit
-            if (currentDigit > 9) {
+            if (currentDigit <= 9) {
                 currentDigit %= 10
                 currentDigit += 1
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it fails the Luhn check.

[Killed] StringLiteral
src/validate-credit-card.js:21:34
 }
 
 const validateCreditCard = (creditCardString) => {
-    const validStartSubString = ['4', '5', '6', '37', '34', '35'] // Valid credit card numbers start with these numbers
+    const validStartSubString = ["", '5', '6', '37', '34', '35'] // Valid credit card numbers start with these numbers
 
     if (typeof creditCardString !== 'string') {
killedBy: validateCreditCard should throw an error for a card number with invalid starting digits
statusReason: expected [Function] to throw error including '9111111111111111 is an invalid credit…' but got '9111111111111111 is an invalid credit…'

[Killed] ConditionalExpression
src/validate-credit-card.js:28:9
     }
 
     const errorMessage = `${creditCardString} is an invalid credit card number because `
-    if (isNaN(creditCardString)) {
+    if (true) {
         throw new TypeError(errorMessage + 'it has nonnumerical characters.')
     }
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because it has nonnumerical characters.

[Killed] ConditionalExpression
src/validate-credit-card.js:32:9
         throw new TypeError(errorMessage + 'it has nonnumerical characters.')
     }
     const creditCardStringLength = creditCardString.length
-    if (!(creditCardStringLength >= 13 && creditCardStringLength <= 16)) {
+    if (true) {
         throw new Error(errorMessage + 'of its length.')
     }
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because of its length.

[Killed] MethodExpression
src/validate-credit-card.js:36:10
         throw new Error(errorMessage + 'of its length.')
     }
     if (
-        !validStartSubString.some((subString) =>
-            creditCardString.startsWith(subString)
-        )
+        !validStartSubString.every(subString => creditCardString.startsWith(subString))
     ) {
         throw new Error(errorMessage + 'of its first two digits.')
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because of its first two digits.

[Killed] BooleanLiteral
src/validate-credit-card.js:36:9
         throw new Error(errorMessage + 'of its length.')
     }
     if (
-        !validStartSubString.some((subString) =>
-            creditCardString.startsWith(subString)
-        )
+        validStartSubString.some(subString => creditCardString.startsWith(subString))
     ) {
         throw new Error(errorMessage + 'of its first two digits.')
killedBy: validateCreditCard should return true for a valid Visa card number
statusReason: 4111111111111111 is an invalid credit card number because of its first two digits.

[Killed] BlockStatement
src/validate-credit-card.js:42:44
     ) {
         throw new Error(errorMessage + 'of its first two digits.')
     }
-    if (!luhnValidation(creditCardString)) {
-        throw new Error(errorMessage + 'it fails the Luhn check.')
-    }
+    if (!luhnValidation(creditCardString)) {}
 
     return true
killedBy: validateCreditCard should throw an error for a card number that fails the Luhn check
statusReason: expected [Function] to throw Error
