[Killed] EqualityOperator
src/catalan-numbers.js:9:9
  */
 
 const catalanNumbers = (n) => {
-    if (n === 0) {
+    if (n !== 0) {
         return [1]
     }
killedBy: Catalan Numbers Tests should return [1] for n = 0
statusReason: expected [ 1, 1 ] to deeply equal [ 1 ]

[Killed] ArrayDeclaration
src/catalan-numbers.js:10:16
 
 const catalanNumbers = (n) => {
     if (n === 0) {
-        return [1]
+        return []
     }
     const catList = [1, 1]
killedBy: Catalan Numbers Tests should return [1] for n = 0
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ArrayDeclaration
src/catalan-numbers.js:12:21
     if (n === 0) {
         return [1]
     }
-    const catList = [1, 1]
+    const catList = []
 
     for (let i = 2; i <= n; i++) {
killedBy: Catalan Numbers Tests should return [1, 1] for n = 1
statusReason: expected [] to deeply equal [ 1, 1 ]

[Killed] BlockStatement
src/catalan-numbers.js:14:34
     }
     const catList = [1, 1]
 
-    for (let i = 2; i <= n; i++) {
-        let newNumber = 0
-        for (let j = 0; j < i; j++) {
-            newNumber += catList[j] * catList[i - j - 1]
-        }
-        catList.push(newNumber)
-    }
+    for (let i = 2; i <= n; i++) {}
 
     return catList
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 2
statusReason: expected [ 1, 1 ] to deeply equal [ 1, 1, 2 ]

[Killed] EqualityOperator
src/catalan-numbers.js:16:25
 
     for (let i = 2; i <= n; i++) {
         let newNumber = 0
-        for (let j = 0; j < i; j++) {
+        for (let j = 0; j >= i; j++) {
             newNumber += catList[j] * catList[i - j - 1]
         }
killedBy: Catalan Numbers Tests should return correct catalan numbers for n = 2
statusReason: expected [ 1, 1, +0 ] to deeply equal [ 1, 1, 2 ]
