[Killed] BlockStatement
src/convex-hull-graham-scan.js:1:24
-function compare(a, b) {
-    // Compare Function to Sort the points, a and b are points to compare
-    if (a.x < b.x) return -1
-    if (a.x === b.x && a.y < b.y) return -1
-    return 1
-  }
+function compare(a, b) {}
   function orientation(a, b, c) {
     // Check orientation of Line(a,b) and Line(b,c)
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(6) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:3:9
 function compare(a, b) {
     // Compare Function to Sort the points, a and b are points to compare
-    if (a.x < b.x) return -1
+    if (true) return -1
     if (a.x === b.x && a.y < b.y) return -1
     return 1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(7) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:3:9
 function compare(a, b) {
     // Compare Function to Sort the points, a and b are points to compare
-    if (a.x < b.x) return -1
+    if (a.x >= b.x) return -1
     if (a.x === b.x && a.y < b.y) return -1
     return 1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(6) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:4:24
 function compare(a, b) {
     // Compare Function to Sort the points, a and b are points to compare
     if (a.x < b.x) return -1
-    if (a.x === b.x && a.y < b.y) return -1
+    if (a.x === b.x && a.y >= b.y) return -1
     return 1
   }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] UnaryOperator
src/convex-hull-graham-scan.js:4:42
 function compare(a, b) {
     // Compare Function to Sort the points, a and b are points to compare
     if (a.x < b.x) return -1
-    if (a.x === b.x && a.y < b.y) return -1
+    if (a.x === b.x && a.y < b.y) return +1
     return 1
   }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] BlockStatement
src/convex-hull-graham-scan.js:7:33
     if (a.x === b.x && a.y < b.y) return -1
     return 1
   }
-  function orientation(a, b, c) {
-    // Check orientation of Line(a,b) and Line(b,c)
-    const alpha = (b.y - a.y) / (b.x - a.x)
-    const beta = (c.y - b.y) / (c.x - b.x)
-  
-    // Clockwise
-    if (alpha > beta) return 1
-    // Anticlockwise
-    else if (beta > alpha) return -1
-    // Colinear
-    return 0
-  }
+  function orientation(a, b, c) {}
   
   function convexHull(points) {
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(13) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:9:20
   }
   function orientation(a, b, c) {
     // Check orientation of Line(a,b) and Line(b,c)
-    const alpha = (b.y - a.y) / (b.x - a.x)
+    const alpha = (b.y + a.y) / (b.x - a.x)
     const beta = (c.y - b.y) / (c.x - b.x)
   
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(6) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ArithmeticOperator
src/convex-hull-graham-scan.js:9:19
   }
   function orientation(a, b, c) {
     // Check orientation of Line(a,b) and Line(b,c)
-    const alpha = (b.y - a.y) / (b.x - a.x)
+    const alpha = (b.y - a.y) * (b.x - a.x)
     const beta = (c.y - b.y) / (c.x - b.x)
   
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(5) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:13:9
     const beta = (c.y - b.y) / (c.x - b.x)
   
     // Clockwise
-    if (alpha > beta) return 1
+    if (false) return 1
     // Anticlockwise
     else if (beta > alpha) return -1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(8) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:13:9
     const beta = (c.y - b.y) / (c.x - b.x)
   
     // Clockwise
-    if (alpha > beta) return 1
+    if (true) return 1
     // Anticlockwise
     else if (beta > alpha) return -1
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(7) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:15:14
     // Clockwise
     if (alpha > beta) return 1
     // Anticlockwise
-    else if (beta > alpha) return -1
+    else if (true) return -1
     // Colinear
     return 0
killedBy: convexHull should handle collinear points correctly
statusReason: expected [ Array(4) ] to deeply equal [ Array(6) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:15:14
     // Clockwise
     if (alpha > beta) return 1
     // Anticlockwise
-    else if (beta > alpha) return -1
+    else if (false) return -1
     // Colinear
     return 0
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(8) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:22:9
   
   function convexHull(points) {
     const pointsLen = points.length
-    if (pointsLen <= 2) {
+    if (true) {
       throw new Error('Minimum of 3 points is required to form closed polygon!')
     }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Minimum of 3 points is required to form closed polygon!

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:37:21
     upperPoints.push(p1)
     lowerPoints.push(p1)
   
-    for (let i = 1; i < pointsLen; i++) {
+    for (let i = 1; i >= pointsLen; i++) {
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {
         let upLen = upperPoints.length
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: +0 } ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:37:21
     upperPoints.push(p1)
     lowerPoints.push(p1)
   
-    for (let i = 1; i < pointsLen; i++) {
+    for (let i = 1; i <= pointsLen; i++) {
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {
         let upLen = upperPoints.length
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] BlockStatement
src/convex-hull-graham-scan.js:38:73
     lowerPoints.push(p1)
   
     for (let i = 1; i < pointsLen; i++) {
-      if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {
-        let upLen = upperPoints.length
-  
-        while (
-          upLen >= 2 &&
-          orientation(
-            upperPoints[upLen - 2],
-            upperPoints[upLen - 1],
-            points[i]
-          ) === -1
-        ) {
-          upperPoints.pop()
-          upLen = upperPoints.length
-        }
-        upperPoints.push(points[i])
-      }
+      if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== -1) {}
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== 1) {
         let lowLen = lowerPoints.length
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ Array(3) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] LogicalOperator
src/convex-hull-graham-scan.js:42:11
         let upLen = upperPoints.length
   
         while (
-          upLen >= 2 &&
-          orientation(
-            upperPoints[upLen - 2],
-            upperPoints[upLen - 1],
-            points[i]
-          ) === -1
+          upLen >= 2 || orientation(upperPoints[upLen - 2], upperPoints[upLen - 1], points[i]) === -1
         ) {
           upperPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:54:34
         }
         upperPoints.push(points[i])
       }
-      if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== 1) {
+      if (i === pointsLen - 1 || orientation(p1, points[i], p2) === 1) {
         let lowLen = lowerPoints.length
         while (
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(2) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:57:11
       if (i === pointsLen - 1 || orientation(p1, points[i], p2) !== 1) {
         let lowLen = lowerPoints.length
         while (
-          lowLen >= 2 &&
-          orientation(
-            lowerPoints[lowLen - 2],
-            lowerPoints[lowLen - 1],
-            points[i]
-          ) === 1
+          false
         ) {
           lowerPoints.pop()
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(6) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:71:21
       }
     }
     const hull = []
-    for (let i = 1; i < upperPoints.length - 1; i++) {
+    for (let i = 1; i <= upperPoints.length - 1; i++) {
       hull.push(upperPoints[i])
     }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(4) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] EqualityOperator
src/convex-hull-graham-scan.js:74:42
     for (let i = 1; i < upperPoints.length - 1; i++) {
       hull.push(upperPoints[i])
     }
-    for (let i = lowerPoints.length - 1; i >= 0; i--) {
+    for (let i = lowerPoints.length - 1; i > 0; i--) {
       hull.push(lowerPoints[i])
     }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 }, …(2) ] to deeply equal [ { x: +0, y: 3 }, …(3) ]

[Killed] ConditionalExpression
src/convex-hull-graham-scan.js:74:42
     for (let i = 1; i < upperPoints.length - 1; i++) {
       hull.push(upperPoints[i])
     }
-    for (let i = lowerPoints.length - 1; i >= 0; i--) {
+    for (let i = lowerPoints.length - 1; false; i--) {
       hull.push(lowerPoints[i])
     }
killedBy: convexHull should return the correct convex hull for a set of points
statusReason: expected [ { x: +0, y: 3 } ] to deeply equal [ { x: +0, y: 3 }, …(3) ]
