[Killed] EqualityOperator
src/number-of-islands.js:7:11
     let counter = 0;
 
     const flood = (row, col) => {
-      if (row < 0 || col < 0) return; // Off the map above or left
+      if (row <= 0 || col < 0) return; // Off the map above or left
       if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
 
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 3 to equal 1

[Killed] LogicalOperator
src/number-of-islands.js:7:11
     let counter = 0;
 
     const flood = (row, col) => {
-      if (row < 0 || col < 0) return; // Off the map above or left
+      if (row < 0 && col < 0) return; // Off the map above or left
       if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
 
killedBy: Islands should return 1 for a grid with one island
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/number-of-islands.js:8:35
 
     const flood = (row, col) => {
       if (row < 0 || col < 0) return; // Off the map above or left
-      if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
+      if (row >= matrix.length || col < matrix[row].length) return; // Off the map below or right
 
       const tile = matrix[row][col];
killedBy: Islands should return 1 for a grid with one island
statusReason: expected 3 to equal 1
