[Killed] BlockStatement
src/temperature-conversion.js:2:38
 class TemperatureConversion {
-  celsiusToFahrenheit = (celsius) => {
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    return Math.round((celsius * 9) / 5 + 32);
-  };
+  celsiusToFahrenheit = (celsius) => {};
 
   celsiusToKelvin = (celsius) => {
killedBy: TemperatureConversion should convert Celsius to Fahrenheit correctly
statusReason: expected undefined to equal 32

[Killed] ArithmeticOperator
src/temperature-conversion.js:5:23
   celsiusToFahrenheit = (celsius) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    return Math.round((celsius * 9) / 5 + 32);
+    return Math.round(celsius * 9 / 5 - 32);
   };
 
killedBy: TemperatureConversion should convert Celsius to Fahrenheit correctly
statusReason: expected -32 to equal 32

[Killed] ArithmeticOperator
src/temperature-conversion.js:5:23
   celsiusToFahrenheit = (celsius) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    return Math.round((celsius * 9) / 5 + 32);
+    return Math.round(celsius * 9 * 5 + 32);
   };
 
killedBy: TemperatureConversion should convert Celsius to Fahrenheit correctly
statusReason: expected 4532 to equal 212

[Killed] BlockStatement
src/temperature-conversion.js:8:34
     return Math.round((celsius * 9) / 5 + 32);
   };
 
-  celsiusToKelvin = (celsius) => {
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
-    return Math.round(celsius + 273.15);
-  };
+  celsiusToKelvin = (celsius) => {};
 
   celsiusToRankine = (celsius) => {
killedBy: TemperatureConversion should convert Celsius to Kelvin correctly
statusReason: expected undefined to equal 273

[Killed] ArithmeticOperator
src/temperature-conversion.js:11:23
   celsiusToKelvin = (celsius) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
     // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
-    return Math.round(celsius + 273.15);
+    return Math.round(celsius - 273.15);
   };
 
killedBy: TemperatureConversion should convert Celsius to Kelvin correctly
statusReason: expected -273 to equal 273

[Killed] BlockStatement
src/temperature-conversion.js:14:35
     return Math.round(celsius + 273.15);
   };
 
-  celsiusToRankine = (celsius) => {
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Rankine_scale
-    return Math.round((celsius * 9) / 5 + 491.67);
-  };
+  celsiusToRankine = (celsius) => {};
 
   fahrenheitToCelsius = (fahrenheit) => {
killedBy: TemperatureConversion should convert Celsius to Rankine correctly
statusReason: expected undefined to equal 492

[Killed] ArithmeticOperator
src/temperature-conversion.js:17:24
   celsiusToRankine = (celsius) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
     // Wikipedia reference: https://en.wikipedia.org/wiki/Rankine_scale
-    return Math.round((celsius * 9) / 5 + 491.67);
+    return Math.round((celsius / 9) / 5 + 491.67);
   };
 
killedBy: TemperatureConversion should convert Celsius to Rankine correctly
statusReason: expected 494 to equal 672

[Killed] ArithmeticOperator
src/temperature-conversion.js:17:23
   celsiusToRankine = (celsius) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
     // Wikipedia reference: https://en.wikipedia.org/wiki/Rankine_scale
-    return Math.round((celsius * 9) / 5 + 491.67);
+    return Math.round(celsius * 9 * 5 + 491.67);
   };
 
killedBy: TemperatureConversion should convert Celsius to Rankine correctly
statusReason: expected 4992 to equal 672

[Killed] BlockStatement
src/temperature-conversion.js:20:41
     return Math.round((celsius * 9) / 5 + 491.67);
   };
 
-  fahrenheitToCelsius = (fahrenheit) => {
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    return Math.round(((fahrenheit - 32) * 5) / 9);
-  };
+  fahrenheitToCelsius = (fahrenheit) => {};
 
   fahrenheitToKelvin = (fahrenheit) => {
killedBy: TemperatureConversion should convert Fahrenheit to Celsius correctly
statusReason: expected undefined to equal +0

[Killed] ArithmeticOperator
src/temperature-conversion.js:23:24
   fahrenheitToCelsius = (fahrenheit) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    return Math.round(((fahrenheit - 32) * 5) / 9);
+    return Math.round(((fahrenheit - 32) / 5) / 9);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Celsius correctly
statusReason: expected 4 to equal 100

[Killed] ArithmeticOperator
src/temperature-conversion.js:23:25
   fahrenheitToCelsius = (fahrenheit) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    return Math.round(((fahrenheit - 32) * 5) / 9);
+    return Math.round(((fahrenheit + 32) * 5) / 9);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Celsius correctly
statusReason: expected 36 to equal +0

[Killed] BlockStatement
src/temperature-conversion.js:26:40
     return Math.round(((fahrenheit - 32) * 5) / 9);
   };
 
-  fahrenheitToKelvin = (fahrenheit) => {
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
-    return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
-  };
+  fahrenheitToKelvin = (fahrenheit) => {};
 
   kelvinToCelsius = (kelvin) => {
killedBy: TemperatureConversion should convert Fahrenheit to Kelvin correctly
statusReason: expected undefined to equal 273

[Killed] ArithmeticOperator
src/temperature-conversion.js:29:23
   fahrenheitToKelvin = (fahrenheit) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
     // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
-    return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
+    return Math.round((fahrenheit - 32) * 5 / 9 - 273.15);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Kelvin correctly
statusReason: expected -273 to equal 273

[Killed] ArithmeticOperator
src/temperature-conversion.js:29:24
   fahrenheitToKelvin = (fahrenheit) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
     // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
-    return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
+    return Math.round(((fahrenheit - 32) / 5) / 9 + 273.15);
   };
 
killedBy: TemperatureConversion should convert Fahrenheit to Kelvin correctly
statusReason: expected 277 to equal 373

[Killed] BlockStatement
src/temperature-conversion.js:32:33
     return Math.round(((fahrenheit - 32) * 5) / 9 + 273.15);
   };
 
-  kelvinToCelsius = (kelvin) => {
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    return Math.round(kelvin - 273.15);
-  };
+  kelvinToCelsius = (kelvin) => {};
 
   kelvinToFahrenheit = (kelvin) => {
killedBy: TemperatureConversion should convert Kelvin to Celsius correctly
statusReason: expected undefined to equal +0

[Killed] ArithmeticOperator
src/temperature-conversion.js:35:23
   kelvinToCelsius = (kelvin) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
     // Wikipedia reference: https://en.wikipedia.org/wiki/Celsius
-    return Math.round(kelvin - 273.15);
+    return Math.round(kelvin + 273.15);
   };
 
killedBy: TemperatureConversion should convert Kelvin to Celsius correctly
statusReason: expected 546 to equal +0

[Killed] BlockStatement
src/temperature-conversion.js:38:36
     return Math.round(kelvin - 273.15);
   };
 
-  kelvinToFahrenheit = (kelvin) => {
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
-    // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    return Math.round(((kelvin - 273.15) * 9) / 5 + 32);
-  };
+  kelvinToFahrenheit = (kelvin) => {};
 }
 
killedBy: TemperatureConversion should convert Kelvin to Fahrenheit correctly
statusReason: expected undefined to equal 32

[Killed] ArithmeticOperator
src/temperature-conversion.js:41:25
   kelvinToFahrenheit = (kelvin) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    return Math.round(((kelvin - 273.15) * 9) / 5 + 32);
+    return Math.round(((kelvin + 273.15) * 9) / 5 + 32);
   };
 }
killedBy: TemperatureConversion should convert Kelvin to Fahrenheit correctly
statusReason: expected 1015 to equal 32

[Killed] ArithmeticOperator
src/temperature-conversion.js:41:23
   kelvinToFahrenheit = (kelvin) => {
     // Wikipedia reference: https://en.wikipedia.org/wiki/Kelvin
     // Wikipedia reference: https://en.wikipedia.org/wiki/Fahrenheit
-    return Math.round(((kelvin - 273.15) * 9) / 5 + 32);
+    return Math.round((kelvin - 273.15) * 9 / 5 - 32);
   };
 }
killedBy: TemperatureConversion should convert Kelvin to Fahrenheit correctly
statusReason: expected -32 to equal 32
